{"Lifehacker":[{"source":{"id":null,"name":"Lifehacker.com"},"author":"Lisa Rowan","title":"Do You Need an Umbrella Insurance Policy?","description":"Once you buy insurance for your car and your house, you might think you’re done. You’re covered if something goes wrong, right? Read more...","url":"https://lifehacker.com/do-you-need-an-umbrella-insurance-policy-1842220776","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ajolqn4igbzmakdgedk4.jpg","publishedAt":"2020-03-10T18:00:00Z","content":"Once you buy insurance for your car and your house, you might think youre done. Youre covered if something goes wrong, right? \r\nBut you may find that in a terrible-case scenario, you could find yourself needing more insurance coverage than one of those polici… [+4557 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"J.D. Roth","title":"How to Negotiate Your Salary","description":"One of the best ways to increase your income is through salary negotiations, either when you’re first offered the job or during a performance review. It may make you uncomfortable, but it’s extremely important. Here’s how to get what you want out of a negotia…","url":"https://lifehacker.com/how-to-negotiate-your-salary-1566202988","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/k7rpvuxtciexhqajpvei.png","publishedAt":"2020-03-06T18:42:00Z","content":"One of the best ways to increase your income is through salary negotiations, either when youre first offered the job or during a performance review. It may make you uncomfortable, but its extremely important. Heres how to get what you want out of a negotiatio… [+9003 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Nicole Dieker on Two Cents, shared by Nicole Dieker to Lifehacker","title":"Can You Still FIRE During a Recession?","description":"I’ve been interested in the financial independence movement, often dubbed FIRE (Financial Independence, Retire Early), for a while. Probably since 2004, when I found an old copy of Vicki Robin and Joe Dominguez’s Your Money or Your Life at the public library.…","url":"https://twocents.lifehacker.com/can-you-still-fire-during-a-recession-1842490866","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/c4xm0hhxfzdkqhllcqjx.jpg","publishedAt":"2020-03-26T18:45:00Z","content":"Ive been interested in the financial independence movement, often dubbed FIRE (Financial Independence, Retire Early), for a while. Probably since 2004, when I found an old copy of Vicki Robin and Joe Dominguezs Your Money or Your Life at the public library. A… [+9118 chars]"}],"Wired":[{"source":{"id":"wired","name":"Wired"},"author":"LAURENCE SCOTT","title":"GIFs Are Glorious, GIFs Are Perverse","description":"The icon of the internet loops from poetry to horror.","url":"https://www.wired.com/story/gifs-are-glorious-gifs-are-perverse/","urlToImage":"https://media.wired.com/photos/5e4c3db1c835cd0008929e74/191:100/w_1280,c_limit/Ideas-GIF-Mirror-Trap-600646603.jpg","publishedAt":"2020-03-02T15:48:33Z","content":"Dwelt on too long, GIFs begin to seem like a constricted, claustrophobic invention. The people caught inside resemble imps trapped in bottles, condemned to speak the same lines over and over, inaudible through the glass. They bring to mind Charlotte Perkins G… [+4347 chars]"}],"Gizmodo":[{"source":{"id":null,"name":"Gizmodo.com"},"author":"Joanna Nelius","title":"Microsoft Office Might Be Good Now, I Know I Know I'm Trying to Delete","description":"Microsoft has given its suite of Office applications a major update and I’m worried because they actually seem useful for regular people. Raise your hand if you’ve ever tracked your monthly budget by copy and pasting your bank account transactions into Excel.…","url":"https://gizmodo.com/microsoft-office-might-be-good-now-i-know-i-know-im-tr-1842561193","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/pfwgkojjonaset6anxxh.gif","publishedAt":"2020-03-30T21:31:00Z","content":"Microsoft has given its suite of Office applications a major update and Im worried because they actually seem useful for regular people. Raise your hand if youve ever tracked your monthly budget by copy and pasting your bank account transactions into Excel. R… [+6404 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Victoria Song","title":"The Never-Ending Death of Smart Home Gadgets","description":"I got my smart TV in early November 2016. It was a 50-inch Samsung—the largest size I could convince my then skeptical roommate to shell out for. We scored a modest deal. At roughly $600 split between two poor millennials, it wasn’t half-bad. (Though, in retr…","url":"https://gizmodo.com/the-never-ending-death-of-smart-home-gadgets-1842456125","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/vfyxsd8m80twnxq4are5.png","publishedAt":"2020-03-24T15:50:00Z","content":"I got my smart TV in early November 2016. It was a 50-inch Samsungthe largest size I could convince my then skeptical roommate to shell out for. We scored a modest deal. At roughly $600 split between two poor millennials, it wasnt half-bad. (Though, in retros… [+17742 chars]"}],"Androidcentral":[{"source":{"id":null,"name":"Androidcentral.com"},"author":"Muhammad Jarir Kanji","title":"Waymo is shutting service, fully driverless vehicles to continue operating","description":"Its partnership with UPS will also continue. What you need to know Waymo says it's suspending its taxi service to help curb the spread of the coronavirus. The exception to this rule will be the company's fully driverless vehicles, which will keep operating fo…","url":"https://www.androidcentral.com/waymo-shutting-service-fully-driverless-vehicles-continue-operating","urlToImage":"https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2016/12/waymo.jpeg?itok=8U_xCXho","publishedAt":"2020-03-18T19:17:15Z","content":"As the coronavirus infection grips the nation and the world, ride-sharing services like Lyft and Uber have been taking measures to reduce human contact via their services. Their upstart, driverless competitor, Waymo, on the other hand, is shutting its service… [+1134 chars]"},{"source":{"id":null,"name":"Androidcentral.com"},"author":"Joe Wituschek","title":"Best Buy closes all retail stores, offers curbside pickup and delivery","description":"Buying something from Best Buy is still possible, but restricted. What you need to know Best Buy has closed all of its retail stores. You can still place an order for curbside pickup or delivery. The company is also suspending installations for refrigerators,…","url":"https://www.androidcentral.com/best-buy-closes-all-retail-stores-offers-curbside-pickup-and-delivery","urlToImage":"https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/postimages/276955/best-buy-store.jpg?itok=ziT8TDwI","publishedAt":"2020-03-23T10:45:53Z","content":"Yesterday, Best Buy joined Apple and hundreds of other retailers in making the decision to close its retail stores to its customers. The company made the announcement on its website, saying that stores are now switching to a curbside pickup model for those wh… [+4040 chars]"}],"Cnet":[{"source":{"id":null,"name":"Cnet.com"},"author":"Rick Broida","title":"This top-rated portable car jump-starter is on sale for $58 - CNET","description":"The Tacklife T8 is also an 18,000-mAh power bank for your phone and other devices. Plus, a Tile Mate tracker for only $15.","url":"https://www.cnet.com/news/this-top-rated-portable-car-jump-starter-is-on-sale-for-57/","urlToImage":"https://cnet4.cbsistatic.com/img/IiNkdfIBDCY2nlZt35qIIqyszLo=/756x567/2020/03/09/be74b2db-e2a8-4659-9524-1bcb3ba637bd/tacklife-t8.jpg","publishedAt":"2020-03-09T14:23:00Z","content":"Jump your car, recharge your phone and more with the Tacklife T8.\r\nTacklife\r\nA dead battery can ruin your whole day -- your car battery, I mean (though a dead phone battery is pretty ruinous as well). Thankfully, portable jump-starters are inexpensive and ple… [+3527 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Kent German","title":"Coronavirus cancellations and delays: From the NBA to Disney films and Broadway - CNET","description":"Industries from tech to sports are reacting to the pandemic. Here's the growing list of events that are affected.","url":"https://www.cnet.com/news/coronavirus-cancellations-and-delays-from-the-nba-to-disney-films-and-broadway/","urlToImage":"https://cnet2.cbsistatic.com/img/dfbuXv3N4JAPQ04OsO_W_OSjzlg=/756x567/2020/01/30/b5ea2465-bbbd-4a2d-a19c-ce75f4d9e53f/gettyimages-185760322.jpg","publishedAt":"2020-03-13T18:31:00Z","content":"A new coronavirus is spreading.\r\nGetty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nThe novel coronavirus continues to wreak havoc in industries worldwide -- from tech and sports to entertainment… [+11780 chars]"}],"Slashdot.org":[{"source":{"id":null,"name":"Slashdot.org"},"author":"EditorDavid","title":"What Happened After San Francisco's Market Street Went Car-Free?","description":"\"Two months after a ban on private cars took effect on a major San Francisco street, bike and e-scooter ridership is soaring, and bus trips are getting quicker,\" reports CityLab: [T]he average number of dockless scooter trips provided by one company, Spin, sh…","url":"https://tech.slashdot.org/story/20/03/15/234226/what-happened-after-san-franciscos-market-street-went-car-free","urlToImage":"https://a.fsdn.com/sd/topics/transportation_64.png","publishedAt":"2020-03-16T01:34:00Z","content":"[T]he average number of dockless scooter trips provided by one company, Spin, shot up by 30 percent after the car ban went into effect, according to an analysis by Populus, a mobility data startup that works with the company. \"Street design changes, big and s… [+1274 chars]"}],"Business Insider":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Mary Meisenzahl","title":"These are the emoji people are using in their coronavirus tweets","description":"Emoji blog Emojipedia researched what emoji were used to talk about coronavirus on Twitter. They also looked at what emoji were more popular in coronavirus tweets to a random sample of tweets. They found that the microbe and face with medical mask emoji saw a…","url":"https://www.businessinsider.com/most-popular-coronavirus-emoji-on-twitter-emojipedia-2020-4","urlToImage":"https://i.insider.com/5e8644320c2a6241d4651664?width=1200&format=jpeg","publishedAt":"2020-04-02T20:33:46Z","content":"People use emoji to talk about everything, and now COVID-19, the coronavirus disease, is no exception. \r\nEmojipedia studied thousands of tweets to learn how people are using emoji to talk about the coronavirus. The face wearing medical mask and microbe emoji … [+101 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Marguerite Ward","title":"Several of my colleagues report racist microaggressions in the wake of coronavirus, and they're not alone. Here's why racism and xenophobia spread with infectious disease.","description":"Since the novel coronavirus first emerged in Wuhan, China, in December 2019, it has infected more than 95,000 people. What's also spreading are xenophobic and racist attacks against people of Asian descent, including microaggressions, or indirect expressions …","url":"https://www.businessinsider.com/americans-see-increase-in-racism-and-xenophobia-as-coronavirus-spreads","urlToImage":"https://i.insider.com/5e613867fee23d2f1001cb76?width=1200&format=jpeg","publishedAt":"2020-03-07T16:00:00Z","content":"A novel coronavirus outbreak that started in Wuhan, China, has killed more than 3,250 people and infected more than 95,000 on every continent except for Antarctica. (The vast majority of cases are in China.) There have been at least 11 reported deaths in the … [+6767 chars]"}],"Entrepreneur":[{"source":{"id":null,"name":"Entrepreneur.com"},"author":"Imran Tariq","title":"4 Strategies to Make Your Sales Funnels Convert in 2020","description":"How to win over customers online.","url":"https://www.entrepreneur.com/article/347168","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20200306191548-GettyImages-947238778.jpeg","publishedAt":"2020-03-11T20:15:00Z","content":"March\r\n11, 2020\r\n7 min read\r\nOpinions expressed by Entrepreneur contributors are their own.\r\nAs an entrepreneur trying to stay relevant and thrive in the competitive digital age, there’s one marketing strategy you’ve likely heard holds the secret to growing y… [+7653 chars]"}],"Smashingmagazine":[{"source":{"id":null,"name":"Smashingmagazine.com"},"author":"Drew McLellan","title":"Smashing Podcast Episode 11 With Eduardo Bouças: What Is Sourcebit?","description":"In this episode of the Smashing Podcast, we’re talking about an interesting open-source tool called Sourcebit. How can it help our content workflow with JAMstack sites? I spoke to developer Eduardo Bouças to find out. Show Notes Sourcebit Video of Sourcebit i…","url":"https://www.smashingmagazine.com/2020/03/smashing-podcast-episode-11/","urlToImage":"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/48f3c4f8-dce3-4202-adf0-b08418fe572f/smashing-podcast-episode-11.png","publishedAt":"2020-03-10T11:30:00Z","content":"In this episode of the Smashing Podcast, were talking about an interesting open-source tool called Sourcebit. How can it help our content workflow with JAMstack sites? I spoke to developer Eduardo Bouças to find out.\r\nShow Notes\r\nTranscript\r\nDrew McLellan: He… [+22364 chars]"}],"Msn":[{"source":{"id":null,"name":"Msn.com"},"author":null,"title":"Walmart, Apple and Olive Garden are among major employers updating sick leave policies as coronavirus cases spread - msnNOW","description":"Walmart, Apple and Olive Garden are among major employers updating sick leave policies as coronavirus cases spread msnNOW Olive Garden's parent begins offering paid sick leave to all employees amid coronavirus outbreak CNBC Orlando-based Darden Restaurants wi…","url":"https://www.msn.com/en-us/money/companies/walmart-apple-and-olive-garden-are-among-major-employers-updating-sick-leave-policies-as-coronavirus-cases-spread/ar-BB110k3q","urlToImage":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB110k3c.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=1493&y=696","publishedAt":"2020-03-10T20:45:00Z","content":"Video by TodayThe coronavirus outbreak that is quickly spreading throughout the country is forcing major American companies to rethink how they approach paid sick leave. More than 30 million U.S. workers many of them low-wage service employees at restaurants,… [+6091 chars]"}],"Kotaku":[{"source":{"id":null,"name":"Kotaku.com"},"author":"Harris O'Malley","title":"Ask Dr. NerdLove: How Do I Rebuild My Marriage After An Affair?","description":"Hello, all you frightening skin machines, and welcome to Ask Dr. NerdLove, the only advice column to survive the Corrupted Blood Plague. Read more...","url":"https://kotaku.com/ask-dr-nerdlove-how-do-i-rebuild-my-marriage-after-an-1842411719","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/p4zz9sdk25jsyge3lflq.jpg","publishedAt":"2020-03-19T16:00:00Z","content":"Hello, all you frightening skin machines, and welcome to Ask Dr. NerdLove, the only advice column to survive the Corrupted Blood Plague.\r\nThe world may be in crisis, but love, dating and relationships are still going on, and with them come relationship troubl… [+20641 chars]"}],"Boingboing.net":[{"source":{"id":null,"name":"Boingboing.net"},"author":"Boing Boing's Shop","title":"This electric scooter is the eco-friendly way to travel and it’s got a changeable battery pack","description":"If you don’t have to drive, why should you? For many, a car or truck is the only feasible way to get from place to place. But if you live in a mostly urban or suburban setting with your job, grocery store and most of your major destinations no more than a few…","url":"https://boingboing.net/2020/03/19/this-electric-scooter-is-the-e.html","urlToImage":"https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/sale_26639_primary_image-1.jpg?fit=630%2C473&ssl=1","publishedAt":"2020-03-19T20:00:03Z","content":"If you dont have to drive, why should you? For many, a car or truck is the only feasible way to get from place to place. But if you live in a mostly urban or suburban setting with your job, grocery store and most of your major destinations no more than a few … [+3554 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Gareth Branwyn","title":"How a woman from Wuhan took care of her infected mother without becoming infected herself","description":"My BFF, Alberto Gaitán, posted this on Facebook. Not medical advice, just a first-person account. This, from a girl from Wuhan who took care of her mother without getting infected herself: https://m.weibo.cn/1260881931/4470252005665688 February 10 02:56 from …","url":"https://boingboing.net/2020/03/15/how-a-woman-from-wuhan-took-ca.html","urlToImage":"https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/virus-1.jpg?fit=700%2C343&ssl=1","publishedAt":"2020-03-15T13:50:50Z","content":"My BFF, Alberto Gaitán, posted this on Facebook.Not medical advice, just a first-person account.\r\nThis, from a girl from Wuhan who took care of her mother without getting infected herself:\r\nhttps://m.weibo.cn/1260881931/4470252005665688\r\nFebruary 10 02:56 fro… [+4759 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Mark Frauenfelder","title":"Good nonfiction: \"Cowhand - The Story of a Working Cowboy\" (1953)","description":"I bought this used paperback copy of Cowhand: The Story of a Working Cowboy, by Fred Gipson, many years ago at a used bookstore. I finally got around to reading it. Here is my book report. The author was born in 1908 on a farm in Texas. He went to the Univers…","url":"https://boingboing.net/2020/03/20/good-nonfiction-cowhand-t.html","urlToImage":"https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/IMG_7992-copy.jpg?fit=700%2C525&ssl=1","publishedAt":"2020-03-20T17:38:18Z","content":"I bought this used paperback copy of Cowhand: The Story of a Working Cowboy, by Fred Gipson, many years ago at a used bookstore. I finally got around to reading it. Here is my book report.\r\nThe author was born in 1908 on a farm in Texas. He went to the Univer… [+3535 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Xeni Jardin","title":"Twitter bans posts that 'dehumanize' people around diseases such as coronavirus","description":"No COVID-19 shaming, please. Twitter announced Thursday it will ban tweets that “dehumanize” people because they have a disease, disability, or because of their age, which happens to correspond to a spike in the number of tweets about the fast-spreading globa…","url":"https://boingboing.net/2020/03/05/twitter-bans-posts-that-dehu.html","urlToImage":"https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/ESS-U6sXkAEhIE8-3.jpg?fit=1200%2C675&ssl=1","publishedAt":"2020-03-05T21:52:36Z","content":"No COVID-19 shaming, please. \r\nTwitter announced Thursday it will ban tweets that dehumanize people because they have a disease, disability, or because of their age, which happens to correspond to a spike in the number of tweets about the fast-spreading globa… [+4211 chars]"}],"The Next Web":[{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Matthew Beedham","title":"Autonomous driving still isn’t a reality in 2020 — and it’s getting people killed","description":"At the end of February, the US National Transport Safety Board presented its findings from a two-year investigation into a fatal crash involving a Tesla Model X driving on Autopilot. Given the current state of the tech, it served as another reminder of how da…","url":"https://thenextweb.com/?p=1277955","urlToImage":"https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2Fthird-autopilot-tesla-propilot-cruise-self-driving-autonomy-cars-EV-future-mobility-driving.png&signature=9a62d1aa83d601720715bd9aa049b492","publishedAt":"2020-03-20T12:49:46Z","content":"At the end of February, the US National Transport Safety Board presented its findings from a two-year investigation into a fatal crash involving a Tesla Model X driving on Autopilot. Given the current state of the tech, it served as another reminder of how da… [+13362 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Jori Hamilton","title":"Facial recognition and AI will invade public privacy — but it can be done ethically","description":"We live in an age where we have unprecedented access to almost any information we need. With the emergence of new technology like artificial intelligence (AI), facial recognition, big data, and more, the human experience is being changed forever. Almost anyth…","url":"https://thenextweb.com/syndication/2020/03/25/facial-recognition-and-ai-will-invade-public-privacy-but-it-can-be-done-ethically/","urlToImage":"https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2F1-22.jpg&signature=c1484a39c5a7178a6bd3c1e74d1ac5f9","publishedAt":"2020-03-25T13:10:45Z","content":"We live in an age where we have unprecedented access to almost any information we need. With the emergence of new technology like artificial intelligence (AI), facial recognition, big data, and more, the human experience is being changed forever. Almost anyth… [+7840 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Ben Dickson","title":"Understanding the limits of convolutional neural networks — one of AI’s greatest achievements","description":"After a prolonged winter, artificial intelligence is experiencing a scorching summer mainly thanks to advances in deep learning and artificial neural networks. To be more precise, the renewed interest in deep learning is largely due to the success of convolut…","url":"https://thenextweb.com/neural/2020/03/20/understanding-the-limits-of-convolutional-neural-networks-one-of-ais-greatest-achievements-syndication/","urlToImage":"https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2FCopy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-...-2.png&signature=7f9e42d49ebb9a8025eb01fd123bff09","publishedAt":"2020-03-20T08:00:57Z","content":"After a prolonged winter, artificial intelligence is experiencing a scorching summer mainly thanks to advances in deep learning and artificial neural networks. To be more precise, the renewed interest in deep learning is largely due to the success of convolut… [+14548 chars]"}],"Fastcompany":[{"source":{"id":null,"name":"Fastcompany.com"},"author":"John Moore Williams","title":"The most important web design trend of 2020","description":"Want to play a role in fighting misinformation in 2020? Read on. It’s no secret that we’ve entered what many are calling the “post-truth” era, with myriad instances of deep fakes, misinformation campaigns, and outright lies popping up, gaining viral traction,…","url":"https://www.fastcompany.com/90473711/the-most-important-web-design-trend-of-2020","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-2-90473711-the-most-important-web-design-trends-of-2020.png","publishedAt":"2020-03-10T08:00:16Z","content":"It’s no secret that we’ve entered what many are calling the “post-truth” era, with myriad instances of deep fakes, misinformation campaigns, and outright lies popping up, gaining viral traction, and ultimately shaping the decision-making of millions — all too… [+9941 chars]"}],"Huffpost":[{"source":{"id":null,"name":"Huffpost.com"},"author":"Hayley Miller","title":"Guns, Ammo Retailers Report Sales Surge Across U.S. Amid Coronavirus Fears","description":"Some buyers are worried about potential lawlessness, others want to stock up in case prices jump.","url":"https://www.huffpost.com/entry/guns-ammo-sales-coronavirus_n_5e6f6a0cc5b6dda30fcd8ebe","urlToImage":"https://img.huffingtonpost.com/asset/5e6f77fa230000a6210c6185.jpeg?cache=9pLO6IhX3l&ops=1200_630","publishedAt":"2020-03-17T16:48:33Z","content":"Toilet paper and hand sanitizer aren’t the only items flying off store shelves as the coronavirus continues to spread across the country. Some gun and ammunition retailers say they’ve seen so much demand in recent weeks that they’re having trouble keeping the… [+7364 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Louise Gleeson","title":"Donald Trump’s ‘Chinese Virus’ Coronavirus Tweet Has Me Scared For My Family","description":"\"The president's dog whistle is unconscionable and could inspire unthinkable actions and dangerous consequences for families like mine.\"","url":"https://www.huffpost.com/entry/trump-chinese-virus-coronavirus_n_5e722040c5b63c3b648828aa","urlToImage":"https://img.huffingtonpost.com/asset/5e7228bc230000101e3a384c.jpeg?cache=vnwkzff3ps&ops=1778_1000","publishedAt":"2020-03-18T17:41:20Z","content":"Just before I climbed back into the car, after dropping bags of groceries at my parents door and firmly declining an offer to come inside for a cup of tea, my mom stepped outside to wave goodbye to me. My dad stayed behind the door watching us through its win… [+7841 chars]"}],"Artofmanliness":[{"source":{"id":null,"name":"Artofmanliness.com"},"author":"Guest Contributor","title":"21 Epigrams Every Man Should Live By","description":"With our archives now 3,500+ articles deep, we’ve decided to republish a classic piece each Friday to help our newer readers discover some of the best, evergreen gems from the past. This article was originally published in January 2018. Editor’s note: This is…","url":"https://www.artofmanliness.com/articles/21-best-epigrams/","urlToImage":"https://content.artofmanliness.com/uploads/2018/01/epigrams2.png","publishedAt":"2020-03-20T13:23:24Z","content":"With our archives now 3,500+ articles deep, weve decided to republish a classic piece each Friday to help our newer readers discover some of the best, evergreen gems from the past. This article was originally published in January 2018.\r\nEditor’s note: This is… [+21341 chars]"}],"Presswatchers.org":[{"source":{"id":null,"name":"Presswatchers.org"},"author":"John Gruber","title":"How to Turn Trump’s Daily Virus Misinformation Show Into a Vector for the Truth","description":"Rather than hide Trump's misinformation-filled briefings or broadcast them as is, the cable news networks should respond by doing journalism – in this case, some journalistic jujitsu. Real-time split-screen bullshit-calling would be a negative consequence for…","url":"https://presswatchers.org/2020/03/how-to-turn-trumps-daily-virus-misinformation-show-into-a-vector-for-the-truth/","urlToImage":"https://secureservercdn.net/198.71.233.109/hnx.548.myftpupload.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-25-at-4.34.52-PM.jpg?time=1585327735","publishedAt":"2020-03-27T20:53:47Z","content":"The nations most eminent media critics are virtually unanimous that television networks should stop the live broadcasting of the White Houses daily coronavirus briefings, which Donald Trump has turned into a torrent of dangerous lies, misinformation and self-… [+16768 chars]"}],"Socialmediaexaminer":[{"source":{"id":null,"name":"Socialmediaexaminer.com"},"author":"Lachlan Kirkwood","title":"How to Connect With Consumers on LinkedIn: 5 B2C Examples","description":"Does your business sell consumer goods? Looking for alternative ways to reach your B2C customers? In this article, you’ll discover how businesses in five B2C industries are using LinkedIn to connect with individual prospects and consumers. The Case for B2C Ou…","url":"https://www.socialmediaexaminer.com/how-to-connect-with-consumers-on-linkedin-5-b2c-examples/","urlToImage":"https://www.socialmediaexaminer.com/wp-content/uploads/2020/03/linkedin-b2c-connect-buyers-1200.png","publishedAt":"2020-04-01T10:00:33Z","content":"Does your business sell consumer goods? Looking for alternative ways to reach your B2C customers?\r\nIn this article, you’ll discover how businesses in five B2C industries are using LinkedIn to connect with individual prospects and consumers.\r\nThe Case for B2C … [+10968 chars]"}],"Theatlantic":[{"source":{"id":null,"name":"Theatlantic.com"},"author":"Caitlin Flanagan","title":"Children of Empire","description":"Meghan Markle’s desire to get out of the hard parts of life could be the most English thing about her. Or at least the most modern-English thing about her.","url":"https://www.theatlantic.com/ideas/archive/2020/03/princess-problem/608032/","urlToImage":"https://cdn.theatlantic.com/thumbor/JRpDWL022wDqgfb2r-ifjCOEYW0=/0x181:4732x2645/960x500/media/img/mt/2020/03/AP_20065699318619/original.jpg","publishedAt":"2020-03-15T11:00:00Z","content":"I n 1940, in the second month of the Blitz, the announcer of a BBC Radio program called Children’s Hour told listeners that they were about to hear the most important episode in the show’s history: Princess Elizabeth was going to address the children of the e… [+32106 chars]"}],"Distill.pub":[{"source":{"id":null,"name":"Distill.pub"},"author":"Chris Olah, Nick Cammarata, Ludwig Schubert, Gabriel Goh, Michael Petrov, Shan Carter","title":"An Introduction to Neural Networks Circuits","description":"By studying the connections between neurons, we can find meaningful algorithms in the weights of neural networks.","url":"https://distill.pub/2020/circuits/zoom-in","urlToImage":"https://distill.pub/2020/circuits/zoom-in/thumbnail.jpg","publishedAt":"2020-03-10T15:48:21Z","content":"Many important transition points in the history of science have been moments when science zoomed in.\r\n At these points, we develop a visualization or tool that allows us to see the world in a new level of detail, and a new field of science develops to study t… [+52416 chars]"}],"Getrichslowly.org":[{"source":{"id":null,"name":"Getrichslowly.org"},"author":"J.D. Roth","title":"Stopping the motor of the world","description":"“What a crazy day,” Kim said yesterday after she got home from work. “Coronavirus?” I asked. “Yeah,” she said. “My schedule fell apart, which I figured it would. But I did see three patients in the morning. All three were doctors. Obviously, they thought it w…","url":"https://www.getrichslowly.org/motor-of-the-world/","urlToImage":null,"publishedAt":"2020-03-17T14:37:51Z","content":"New here? You may want updates via email or RSS feed. Thanks for visiting!\r\n“What a crazy day,” Kim said yesterday after she got home from work.\r\n“Coronavirus?” I asked.\r\n“Yeah,” she said. “My schedule fell apart, which I figured it would. But I did see three… [+9513 chars]"},{"source":{"id":null,"name":"Getrichslowly.org"},"author":"Michelle Clardie","title":"How to build credit the quick and easy way","description":"Most Americans know that it's important to build credit but many don't know how. If you're one of those confused about how to build credit, you're not alone. In 2019, CNBC reported that around 40% of Americans don’t know how credit scores work. This is a disa…","url":"https://www.getrichslowly.org/how-to-build-credit/","urlToImage":"https://www.getrichslowly.org/wp-content/uploads/how-to-build-credit.jpg","publishedAt":"2020-03-12T07:30:53Z","content":"New here? You may want updates via email or RSS feed. Thanks for visiting!\r\nMost Americans know that it's important to build credit but many don't know how. If you're one of those confused about how to build credit, you're not alone.\r\nIn 2019, CNBC reported t… [+8866 chars]"}],"Websitesetup.org":[{"source":{"id":null,"name":"Websitesetup.org"},"author":"Chris Coyier","title":"15 Things to Improve Your Website Accessibility","description":"This is a really great list from Bruce. There is a lot of directly actionable stuff here. Send it around to your team and make it something that you all go through together. Here's a little one that prodded me to finally fix... Most screen readers allow the u…","url":"https://websitesetup.org/web-accessibility-checklist/","urlToImage":"https://websitesetup.org/wp-content/uploads/2020/03/reCAPTCHA1.jpg","publishedAt":"2020-03-17T14:54:34Z","content":"About author: Bruce Lawson is a a freelance accessibility consultant. He co-authored the books ‘Introducing HTML5’ and ‘Web Accessibility’. He was a co-editor of the W3C HTML5.3 specification and a member of the committee that drafted BS8878 the British Stand… [+31077 chars]"}],"Autobloghttps":[{"source":{"id":null,"name":"Autoblog.comhttps"},"author":"Jonathon Ramsey","title":"Hyundai Veloster N with eight-speed DCT to show next month?","description":"Filed under: Hyundai, Coupe, Crossover, Hatchback, Performance, sedan Continue reading Hyundai Veloster N with eight-speed DCT to show next month? Hyundai Veloster N with eight-speed DCT to show next month? originally appeared on Autoblog on Fri, 13 Mar 2020 …","url":"https://www.autoblog.comhttps://www.autoblog.com/2020/03/13/hyundai-veloster-n-eight-speed-dual-clutch-transmission/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/800x450/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2020/03/13054741/2020-hyundai-veloster-n-281.jpg","publishedAt":"2020-03-13T12:35:00Z","content":"In mid-2018, reports emerged that Hyundai was developing an eight-speed wet clutch dual-clutch transmission for the then-new i30 N, and it would appear around the end of 2019. The natural conclusion was that the Veloster N would get the same transmission arou… [+2379 chars]"}],"Windowscentral":[{"source":{"id":null,"name":"Windowscentral.com"},"author":"Joe Wituschek","title":"Best Buy closes all retail stores, offers curbside pickup and delivery","description":"Buying something from Best Buy is still possible, but restricted. What you need to know Best Buy has closed all of its retail stores. You can still place an order for curbside pickup or delivery. The company is also suspending installations for refrigerators,…","url":"https://www.windowscentral.com/best-buy-closes-all-retail-stores-offers-curbside-pickup-and-delivery","urlToImage":"https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/postimages/276955/best-buy-store.jpg?itok=jm_lWjfi","publishedAt":"2020-03-23T10:46:51Z","content":"Yesterday, Best Buy joined Apple and hundreds of other retailers in making the decision to close its retail stores to its customers. The company made the announcement on its website, saying that stores are now switching to a curbside pickup model for those wh… [+4040 chars]"}],"Kk.org":[{"source":{"id":null,"name":"Kk.org"},"author":"claudia","title":"Refilling Your Own SodaStream Cartridges","description":"Gareth's Tips, Tools, and Shop Tales - Issue #37","url":"https://kk.org/cooltools/refilling-your-own-sodastream-cartridges/","urlToImage":"https://kk.org/cooltools/files/2020/02/basichousehold.jpeg","publishedAt":"2020-03-05T16:00:38Z","content":"Gareth's Tips, Tools, and Shop Tales - Issue #37\r\nThe latest issue of HackSpace magazine is out, issue 28 [Free PDF]. I have a piece in there (pgs 90-91) on tips and recommendations for improving shop organization and storage.***\r\nFor those here who might be … [+4731 chars]"}],"Lifehack.org":[{"source":{"id":null,"name":"Lifehack.org"},"author":"Aleksandra Slijepcevic","title":"How to Effectively Cope with Work Anxiety","description":"According to the American Institute of Stress, approximately 83% of American workers suffer from work-related stress.[1] Some of this stress can be moderate to mild, while at other times, the stress can lead to more complex problems, such as depression, anxie…","url":"https://www.lifehack.org/866217/work-anxiety","urlToImage":"https://cdn.lifehack.org/wp-content/uploads/2020/03/work-anxiety.jpg","publishedAt":"2020-03-10T15:00:17Z","content":"Are you someone who likes to grow? Do you constantly seek to improve yourself and become better?\r\nIf you do, then we have something in common.\r\nI’m very passionate about personal growth. It was just 4 years ago when I discovered my passion for growing and hel… [+18525 chars]"}],"Theregister.co.uk":[{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Kieren McCarthy","title":"Drones must be constantly connected to the internet to give Feds real-time location data – new US govt proposal","description":"'Does it have its own satellite dish, sir?' 'You can tell your son it has its own satellite' Drone enthusiasts are up in arms over rules proposed by the US Federal Aviation Administration (FAA) that would require their flying gizmos to provide real-time locat…","url":"https://www.theregister.co.uk/2020/03/02/faa_drone_rules_proposed/","urlToImage":"https://regmedia.co.uk/2017/11/20/drone_flier_shutterstock.jpg","publishedAt":"2020-03-02T21:55:55Z","content":"Drone enthusiasts are up in arms over rules proposed by the US Federal Aviation Administration (FAA) that would require their flying gizmos to provide real-time location data to the government via an internet connection.\r\nThe requirement, for drones weighing … [+7814 chars]"},{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Kieren McCarthy","title":"Drones must be constantly connected to the internet to give Feds real-time location data – new US govt prosposal","description":"'Does it have its own satellite dish, sir?' 'You can tell your son it has its own satellite' Drone enthusiasts are up in arms over rules proposed by the US Federal Aviation Administration (FAA) that would require their flying gizmos to provide real-time locat…","url":"https://www.theregister.co.uk/2020/03/02/drone_fcc_rules/","urlToImage":"https://regmedia.co.uk/2017/11/20/drone_flier_shutterstock.jpg","publishedAt":"2020-03-02T21:55:55Z","content":"Drone enthusiasts are up in arms over rules proposed by the US Federal Aviation Administration (FAA) that would require their flying gizmos to provide real-time location data to the government via an internet connection.\r\nThe requirement, for drones weighing … [+7814 chars]"}],"Diyphotography.net":[{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Photographer creates goofy and emotional portraits of his friends in quarantine","description":"If you’ve been disciplined during the coronavirus outbreak, you probably haven’t seen your friends for a while. And if there’s one thing all of us in self-isolation have in common, it’s this: we miss out friends! Photographer Jared Gruenwald is one of us, and…","url":"https://www.diyphotography.net/photographer-creates-goofy-and-emotional-portraits-of-his-friends-in-quarantine/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/through_the_lockdown_glass_007.jpg.optimal.jpg","publishedAt":"2020-03-27T16:42:16Z","content":"If youve been disciplined during the coronavirus outbreak, you probably havent seen your friends for a while. And if theres one thing all of us in self-isolation have in common, its this: we miss out friends! Photographer Jared Gruenwald is one of us, and he … [+2988 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Allen Murabayashi","title":"How the kids are learning photography on TikTok","description":"TikTok, the video-based social media app, usually conjures visions of teens mimicking the latest dance craze, but it’s probably better described as short attention span YouTube. In 2017, ByteDance, the Chinese-owned parent company of TikTok, acquired the Musi…","url":"https://www.diyphotography.net/how-the-kids-are-learning-photography-on-tiktok/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/tiktok-photography.jpg.optimal.jpg","publishedAt":"2020-03-10T14:25:02Z","content":"TikTok, the video-based social media app, usually conjures visions of teens mimicking the latest dance craze, but its probably better described as short attention span YouTube. In 2017, ByteDance, the Chinese-owned parent company of TikTok, acquired the Music… [+3535 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Blair Bunting","title":"A Tale of Two 24-70’s: Nikkor S and G","description":"First, a little backstory to this piece… For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, let’s just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross…","url":"https://www.diyphotography.net/a-tale-of-two-24-70s-nikkor-s-and-g/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/nikons.jpg.optimal.jpg","publishedAt":"2020-03-10T11:21:56Z","content":"First, a little backstory to this piece For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, lets just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross-s… [+6947 chars]"}],"Dpreview":[{"source":{"id":null,"name":"Dpreview.com"},"author":"Kara Murphy, Gannon Burgett","title":"Photography deals, discounts and freebies for making the most of being stuck inside","description":"As the number of newly-diagnosed Coronavirus cases continues to increase, so do the strict orders to stay home. For some, this means an increase in free time along with a decline in disposable income. Across the photography community, multiple retailers, soft…","url":"https://www.dpreview.com/news/3505607911/photography-deals-discounts-and-freebies-for-making-the-most-of-being-stuck-inside","urlToImage":"https://4.img-dpreview.com/files/p/E~TS940x788~articles/3505607911/5147252155.jpeg","publishedAt":"2020-03-27T16:59:00Z","content":"As the number of newly-diagnosed Coronavirus cases continues to increase, so do the strict orders to stay home. For some, this means an increase in free time along with a decline in disposable income. Across the photography community, multiple retailers, soft… [+7960 chars]"}],"Iwillteachyoutoberich":[{"source":{"id":null,"name":"Iwillteachyoutoberich.com"},"author":"Lars Lofgren","title":"How to Make Money on Your Phone in 2020","description":"You can make money with nothing but your phone. Below, I’ve listed the best ways to turn spare time on your phone into cash. To be clear, you’re not likely to get rich (at least not quickly) with these methods. … Continued How to Make Money on Your Phone in 2…","url":"https://www.iwillteachyoutoberich.com/blog/make-money-on-your-phone/","urlToImage":"https://cdn.iwillteachyoutoberich.com/wp-content/uploads/Ramit_headshot2.png","publishedAt":"2020-03-23T13:16:52Z","content":"You can make money with nothing but your phone.\r\nBelow, Ive listed the best ways to turn spare time on your phone into cash.\r\nTo be clear, you’re not likely to get rich (at least not quickly) with these methods. We did put together the options  that have the … [+8521 chars]"},{"source":{"id":null,"name":"Iwillteachyoutoberich.com"},"author":"Lars Lofgren","title":"How to Make Money From Home in 2020","description":"Making money from the comfort of your own home has never been easier. No matter your background, education, skills, or age, you can make money on your couch. I’m one of those people. I own multiple websites and online businesses, … Continued How to Make Money…","url":"https://www.iwillteachyoutoberich.com/blog/make-money-from-home/","urlToImage":"https://cdn.iwillteachyoutoberich.com/wp-content/uploads/Ramit_headshot2.png","publishedAt":"2020-03-04T16:50:49Z","content":"Making money from the comfort of your own home has never been easier. No matter your background, education, skills, or age, you can make money on your couch.\r\nIm one of those people. I own multiple websites and online businesses, meaning I can work from anywh… [+14183 chars]"}],"Jalopnik":[{"source":{"id":null,"name":"Jalopnik.com"},"author":"Justin T. Westbrook","title":"Hyundai's Mid-Engine Hatchback May Get A 390 HP Hybrid 2.3-Liter Turbo Engine: Report","description":"New spy photos of what’s clearly a mid-engine Hyundai Veloster hatchback have led to reports the production car will end up with a 2.3-liter turbocharged hybrid powertrain matching the concept car’s 390 horsepower. Read more...","url":"https://jalopnik.com/hyundais-mid-engine-hatchback-may-get-a-390-hp-hybrid-2-1842617275","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/x0mfnlid4pdhvpwvh5jz.jpg","publishedAt":"2020-04-01T22:00:00Z","content":"New spy photos of whats clearly a mid-engine Hyundai Veloster hatchback have led to reports the production car will end up with a 2.3-liter turbocharged hybrid powertrain matching the concept cars 390 horsepower.\r\nAs hard as it is to believe, Hyundai is in fa… [+1892 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Andrew P. Collins","title":"Here Are My Favorite 2020 Land Rover Defender Features After Field Testing In Africa","description":"The 2020 Land Rover Defender has a tough job: It has to live up to the expectations of the snootiest car buyers on Earth while serving as the future-facing halo car for the company that basically invented the luxury 4x4. As such it’s loaded with tech and toys…","url":"https://jalopnik.com/here-are-my-favorite-2020-land-rover-defender-features-1841983008","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rabriwxkad0juoafl827.jpg","publishedAt":"2020-03-03T21:15:00Z","content":"The 2020 Land Rover Defender has a tough job: It has to live up to the expectations of the snootiest car buyers on Earth while serving as the future-facing halo car for the company that basically invented the luxury 4x4. As such its loaded with tech and toys,… [+6151 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Tom McParland","title":"I'm A Tall Dude That Needs Something Small And Easy To Park! What Car Should I Buy?","description":"Jake lives in San Francisco where parking is a challenge he wants a compact city car that can squeeze into tight spaces, but there is just one problem: He is 6’5.” Most things feel a bit claustrophobic for him. What car should he buy? Read more...","url":"https://jalopnik.com/im-a-tall-dude-that-needs-something-small-and-easy-to-p-1842507206","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cptnhavnnh4ohhismkwr.jpg","publishedAt":"2020-03-26T16:50:00Z","content":"Jake lives in San Francisco where parking is a challenge he wants a compact city car that can squeeze into tight spaces, but there is just one problem: He is 65. Most things feel a bit claustrophobic for him. What car should he buy?\r\n(Welcome back to What Car… [+6284 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Kristen Lee","title":"Use Microfiber Towels To Clean Your Home","description":"This blog just popped into my head, since it’s something I’ve been doing for years and I figured some of you might benefit from it, too. Use microfiber towels to clean your homes, friends! If they’re good enough for your prized clear coat, then they’re also g…","url":"https://jalopnik.com/use-microfiber-towels-to-clean-your-home-1842428711","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v9ipqsq3ufrp7jicudw4.jpg","publishedAt":"2020-03-20T18:00:00Z","content":"This blog just popped into my head, since its something Ive been doing for years and I figured some of you might benefit from it, too. Use microfiber towels to clean your homes, friends! If theyre good enough for your prized clear coat, then theyre also good … [+3975 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Andrew P. Collins","title":"I'm Happy To Report That There Is A 'Lamborghini Wave'","description":"I spent a few days buzzing around Los Angeles in a borrowed Aventador SVJ and learned, among other things, that other Lamborghini drivers were more likely to seem like actual car enthusiasts than conceited gasbags. To be honest, this brought me a lot of joy! …","url":"https://jalopnik.com/im-happy-to-report-that-there-is-a-lamborghini-wave-1842219009","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sicyrzjsgkrretxlcswq.jpg","publishedAt":"2020-03-10T02:00:00Z","content":"I spent a few days buzzing around Los Angeles in a borrowed Aventador SVJ and learned, among other things, that other Lamborghini drivers were more likely to seem like actual car enthusiasts than conceited gasbags. To be honest, this brought me a lot of joy!\r… [+1749 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Andrew P. Collins","title":"How To Drive A Supercar Without Ending Up In An Embarrassing YouTube Video","description":"I gave as many rides as I could in the short time I babysat a Lamborghini Aventador SVJ. “I’d love to rent something like this one day,” one passenger confided. “But I’d be afraid to crash it.” A valid concern I’m happy to try and allay for non-pros who might…","url":"https://jalopnik.com/how-to-drive-a-supercar-without-ending-up-in-an-embarra-1842252797","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/q0muyim9ujwr1vlaq5qy.jpg","publishedAt":"2020-03-11T19:00:00Z","content":"I gave as many rides as I could in the short time I babysat a Lamborghini Aventador SVJ. Id love to rent something like this one day, one passenger confided. But Id be afraid to crash it. A valid concern Im happy to try and allay for non-pros who might find t… [+5099 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Kristen Lee","title":"Stay Fancy, Motherfuckers","description":"I have a shameful confession to make. Until I started working here, I didn’t read much Jalopnik. Like, at all. I didn’t read it in high school, college, or really during my time writing for Road & Track. I realize now what a grave disservice I was doing mysel…","url":"https://jalopnik.com/stay-fancy-motherfuckers-1842565069","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cxhdcfgfx5elocmjtgls.png","publishedAt":"2020-03-31T22:00:00Z","content":"I have a shameful confession to make. Until I started working here, I didnt read much Jalopnik. Like, at all. I didnt read it in high school, college, or really during my time writing for Road &amp; Track. I realize now what a grave disservice I was doing mys… [+4843 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Michael Ballaban","title":"Ejecto Seat, Kristen Lee","description":"It’s a lot harder to hire for this dang place than it looks. Sure a person can drive, but can they write? Sure, a person can write, but can they write well? Sure, a person can write well, but can they truly be Jalopnik? Read more...","url":"https://jalopnik.com/ejecto-seat-kristen-lee-1842588030","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sofw8sao33fychyvylwe.png","publishedAt":"2020-03-31T20:35:00Z","content":"Its a lot harder to hire for this dang place than it looks. Sure a person can drive, but can they write? Sure, a person can write, but can they write well? Sure, a person can write well, but can they truly be Jalopnik?\r\nIt was late June of 2016, and we were d… [+19678 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Michael Ballaban","title":"Coronavirus Pandemic Shuts Down Lamborghini Factory","description":"The global pandemic finally takes out Lamborghini, it looks like it may be about to take at least a chunk out of Fiat Chrysler, and Volkswagen’s got some technology. All that and more in the Morning Shift for March 13, 2020. Read more...","url":"https://jalopnik.com/coronavirus-pandemic-shuts-down-lamborghini-factory-1842311596","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/vpm4v8qf8qeopwyphk8w.jpg","publishedAt":"2020-03-13T14:10:00Z","content":"The global pandemic finally takes out Lamborghini, it looks like it may be about to take at least a chunk out of Fiat Chrysler, and Volkswagens got some technology. All that and more in the Morning Shift for March 13, 2020.\r\n1st Gear: The Lamborghini Shutdown… [+8871 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Erik Shilling","title":"The Failure Of This Self-Driving Truck Company Tells You All You Need To Know About Self-Driving Vehicles","description":"Starsky Robotics is a self-driving truck company that was the first company to run an unmanned semi on a public highway. It’s now shutting down though, and its co-founder has some unusually sensible and honest things to say about the industry, unusual only be…","url":"https://jalopnik.com/the-failure-of-this-self-driving-truck-company-tells-yo-1842417033","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ssmucfkuvh5n6owl8ooj.png","publishedAt":"2020-03-20T13:30:00Z","content":"Starsky Robotics is a self-driving truck company that was the first company to run an unmanned semi on a public highway. Its now shutting down though, and its co-founder has some unusually sensible and honest things to say about the industry, unusual only bec… [+4168 chars]"}],"Ritholtz":[{"source":{"id":null,"name":"Ritholtz.com"},"author":"Barry Ritholtz","title":"Transcript: David Dunning","description":"The transcript from this week’s, MiB: David Dunning on Metacognition, is below. You can stream and download our full conversation, including the podcast extras, on Apple iTunes, Spotify, Overcast, Google, Bloomberg, and Stitcher. All of our earlier podcasts o…","url":"https://ritholtz.com/2020/03/transcript-david-dunning/","urlToImage":"https://ritholtz.com/wp-content/uploads/2016/10/MIB-.png","publishedAt":"2020-03-22T16:00:51Z","content":"The transcript from this weeks, MiB: David Dunning on Metacognition,  is below.\r\nYou can stream and download our full conversation, including the podcast extras, on Apple iTunes, Spotify, Overcast, Google, Bloomberg, and Stitcher. All of our earlier podcasts … [+88450 chars]"},{"source":{"id":null,"name":"Ritholtz.com"},"author":"Barry Ritholtz","title":"Transcript: Ben Cohen","description":"The transcript from this week’s, MiB: Ben Cohen on Streaks, is below. You can stream and download our full conversation, including the podcast extras, on Apple iTunes, Spotify, Overcast, Google, Bloomberg, and Stitcher. All of our earlier podcasts on your fav…","url":"https://ritholtz.com/2020/03/transcript-ben-cohen/","urlToImage":"https://ritholtz.com/wp-content/uploads/2016/10/MIB-.png","publishedAt":"2020-03-29T16:00:47Z","content":"The transcript from this weeks, MiB: Ben Cohen on Streaks, is below.\r\nYou can stream and download our full conversation, including the podcast extras, on Apple iTunes, Spotify, Overcast, Google, Bloomberg, and Stitcher. All of our earlier podcasts on your fav… [+109261 chars]"}],"Hypebeast":[{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"Best New Tracks: PARTYNEXTDOOR & Rihanna, Rosalía, Knxwledge & More","description":"This week, artists banded together to livestream, release surprise singles, and push their respective projects forward to help their fans deal with the isolation and self-quarantine of the current Coronavirus (COVID-19) pandemic. With people across the globe …","url":"https://hypebeast.com/2020/3/best-new-tracks-march-27-2020-partynextdoor-rihanna-rosalia-knxwledge","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fhypebeast-best-new-tracks-march-27-2020-partynextdoor-rihanna-rosalia-kehlani-tw.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2020-03-27T20:57:54Z","content":"This week, artists banded together to livestream, release surprise singles, and push their respective projects forward to help their fans deal with the isolation and self-quarantine of the current Coronavirus (COVID-19) pandemic. With people across the globe … [+6421 chars]"}],"Thesimpledollar":[{"source":{"id":null,"name":"Thesimpledollar.com"},"author":"Trent Hamm","title":"Mailbag: Questions About Pensions, Cell Plans, Bulk Nonperishables, Refinancing and More","description":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question. 1. Retirement savings beyond public pension 2. Best time to file taxes 3. Str…","url":"https://www.thesimpledollar.com/reader-mailbag/pensions-cell-plans-bulk-nonperishables-refinancing-and-more/","urlToImage":"https://www.thesimpledollar.com/wp-content/uploads/2017/09/4516762897_07e3c936ac_b-e1523286639332.jpg","publishedAt":"2020-03-09T14:00:10Z","content":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question.1. Retirement savings beyond public pension2. Best time to file taxes3. Strugg… [+20779 chars]"},{"source":{"id":null,"name":"Thesimpledollar.com"},"author":"Trent Hamm","title":"Questions About Rebalancing, Roth Contributions, Cash in Hand, Disney+, and More!","description":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question. 1. Rebalancing my retirement funds 2. 2019 Roth IRA contribution date? 3. Pre…","url":"https://www.thesimpledollar.com/reader-mailbag/rebalancing-roth-contributions-cash-in-hand-disney-and-more/","urlToImage":"https://www.thesimpledollar.com/wp-content/uploads/2016/05/twenty20_f12f5d25-1b49-430a-bbe7-f8c85892a507-e1462816533665.jpg","publishedAt":"2020-03-30T14:00:41Z","content":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question.1. Rebalancing my retirement funds2. 2019 Roth IRA contribution date?3. Preppi… [+17982 chars]"}],"Smallbiztrends":[{"source":{"id":null,"name":"Smallbiztrends.com"},"author":"Rob Starr","title":"How to Look Good Live Streaming Yourself from Home","description":"In the time of social distancing, video conferencing can help you have more open and engaging conversations. Here's how to look good live streaming.","url":"https://smallbiztrends.com/2020/04/look-good-live-streaming.html","urlToImage":"https://smallbiztrends.com/wp-content/uploads/2020/03/Live-Streaming-Yourself.png","publishedAt":"2020-04-01T11:30:02Z","content":"During the COVID -19 pandemic, some SMB focus is shifting to remote work. For many small businesses that means learning a new norm including live streaming from home. Small Business Trends contacted Jennifer L. Jacobson, Founder of Jacobson Communication, to … [+2953 chars]"},{"source":{"id":null,"name":"Smallbiztrends.com"},"author":"Samson Haileyesus","title":"101 Public Relations Strategies, Tips and Examples","description":"PR can be a strong addition to your marketing mix. Start with our list of 101 public relations examples, strategies, and tips.","url":"https://smallbiztrends.com/2020/03/public-relations-strategies-tips-examples.html","urlToImage":"https://smallbiztrends.com/wp-content/uploads/2020/03/Public-Relations-Strategies.png","publishedAt":"2020-03-09T12:00:00Z","content":"Public Relations (PR) helps build and maintain positive public image of your business to the public. At the heart of this form of communication lies effective dialogue. It includes gaining exposure to audiences using topics of public interest and news items t… [+41661 chars]"}],"Mrmoneymustache":[{"source":{"id":null,"name":"Mrmoneymustache.com"},"author":"Mr. Money Mustache","title":"Lessons in Fear and Wealth from the Coronavirus","description":"As I write this, the biggest story in the entire world is a virus that is making its way around the planet, leaving a trail of sickness and death in its wake, while sending a much bigger shockwave of fear and uncertainty out front. Last week, the US stock mar…","url":"https://www.mrmoneymustache.com/2020/03/03/coronavirus-stock-market/","urlToImage":"https://www.mrmoneymustache.com/wp-content/uploads/2020/03/coronavirus-fears.png","publishedAt":"2020-03-03T20:52:56Z","content":"As I write this, the biggest story in the entire world is a virus that is making its way around the planet, leaving a trail of sickness and death in its wake, while sending a much bigger shockwave of fear and uncertainty out front. Last week, the US stock mar… [+8383 chars]"}],"Imore":[{"source":{"id":null,"name":"Imore.com"},"author":"Joe Wituschek","title":"Best Buy closes all retail stores, offers curbside pickup and delivery","description":"Buying something from Best Buy is still possible, but restricted. What you need to know Best Buy has closed all of its retail stores. You can still place an order for curbside pickup or delivery. The company is also suspending installations for refrigerators,…","url":"https://www.imore.com/best-buy-closes-all-retail-stores-offers-curbside-pickup-and-delivery","urlToImage":"https://www.imore.com/sites/imore.com/files/styles/large/public/postimages/276955/best-buy-store.jpg?itok=_VxGI2aP","publishedAt":"2020-03-22T17:07:12Z","content":"Yesterday, Best Buy joined Apple and hundreds of other retailers in making the decision to close its retail stores to its customers. The company made the announcement on its website, saying that stores are now switching to a curbside pickup model for those wh… [+4040 chars]"}],"Petapixel":[{"source":{"id":null,"name":"Petapixel.com"},"author":"Blair Bunting","title":"A Tale of Two 24-70s: Nikon Z-Mount vs F-Mount Lens Comparison","description":"First, a little backstory. For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, let’s just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross-style manual …","url":"https://petapixel.com/2020/03/10/a-tale-of-two-24-70s-nikon-z-mount-vs-f-mount-lens-comparison/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PetaPixel+%28PetaPixel%29","urlToImage":"https://petapixel.com/assets/uploads/2020/03/nikonlenscomparison_1.jpg","publishedAt":"2020-03-10T17:37:05Z","content":"First, a little backstory. For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, lets just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross-style manual f… [+6815 chars]"}],"Gamasutra":[{"source":{"id":null,"name":"Gamasutra.com"},"author":"Katherine Cross","title":"Don't Miss: Neo Cab and the effort to make an empathetic game about gamification","description":"\"We're less interested in creating a character that players will empathize with than we are in creating a character whose empathy is core to her strength,\" says Neo Cab dev Patrick Ewing....","url":"https://gamasutra.com/view/news/317945/Opinion_Neo_Cab_and_the_effort_to_make_an_empathetic_game_about_gamification.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29","urlToImage":"http://gamasutra.com/db_area/images/news/2018/May/317945/neocab1.jpg","publishedAt":"2020-03-12T19:25:00Z","content":"I've rarely come across a video game where its subject determines the mechanics in such exacting detail.\r\nNeo Cab, Chance Agency’s forthcoming visual novel about driving a rideshare taxi à la Lyft or Uber, draws deeply on those companies’ gamified incentives … [+10229 chars]"}],"Vox":[{"source":{"id":null,"name":"Vox.com"},"author":"Nicole Dieker","title":"Money Talks: This family declared bankruptcy. Now they’re figuring out how to rebuild.","description":"The Running Balance newsletter follows a family of four living on one income in a major US city. Here’s how they do it.","url":"https://www.vox.com/the-goods/2020/3/24/21191066/money-talks-bankruptcy-running-balance-newsletter","urlToImage":"https://cdn.vox-cdn.com/thumbor/4YcPTo15Y0_XehjrtlAR0od9RfU=/0x40:2121x1150/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19826314/GettyImages_1195039214.png","publishedAt":"2020-03-24T12:00:00Z","content":"Christina Animashaun/Vox; Getty Images The Running Balance newsletter follows a family of four living on one income in a major US city. Here’s how they do it. Welcome to Money Talks, a series in which we interview people about their relationships with money, … [+12701 chars]"}],"Politico":[{"source":{"id":"politico","name":"Politico"},"author":"Ryan Heath","title":"Emissions are down thanks to coronavirus, but that's bad","description":"Climate advocates will have to carefully navigate political turbulence","url":"https://www.politico.com/news/2020/03/13/climate-advocates-hit-political-turbulence-127649","urlToImage":"https://static.politico.com/94/ff/fbcfd86f48c381c104e35bdd27ed/global-translations-share.png","publishedAt":"2020-03-13T13:01:35Z","content":"It's after any recession that the real problems can start for climate advocates. Helen Mountford of the World Resources Institute said that post-recession economies can see a surge in emissions: \"After the global financial crisis of 2008, for example, global … [+6074 chars]"}],"Thehustle.co":[{"source":{"id":null,"name":"Thehustle.co"},"author":null,"title":"Amid A Pandemic, Uber Drivers Choose Between Health And Livelihood","description":"As America holes up inside, thousands of full-time rideshare drivers are still out on the streets trying to carve out a living.","url":"https://thehustle.co/coronavirus-uber-lyft-drivers/","urlToImage":"https://thehustle.co/wp-content/uploads/2020/03/share2.jpg","publishedAt":"2020-03-22T22:10:41Z","content":"In the age of COVID-19 of work-from-home quarantines, sweatpants, and Facetime cocktails Mostafa Maklads routine is largely the same.\r\nHis day begins in a 2-bedroom Daly City, California apartment he shares with 6 other Uber drivers. He drinks a cup of coffee… [+14635 chars]"}],"Medium":[{"source":{"id":null,"name":"Medium.com"},"author":"Adam Bluestein","title":"They Led The Cult Of Remote Work. Now We're All Members","description":"“Obviously, the news is a big deal,” said Jason Fried on a call last week. The markets were spiraling, his hometown of Chicago had just issued a stay-at-home order, and the coronavirus pandemic…","url":"https://marker.medium.com/they-led-the-cult-of-remote-work-now-were-all-members-200897f9afe0","urlToImage":"https://miro.medium.com/focal/1200/632/52/25/1*42vrhIFNDQxdWBicR9wd7g.jpeg","publishedAt":"2020-04-02T17:13:29Z","content":"Obviously, the news is a big deal, said Jason Fried on a call last week. The markets were spiraling, his hometown of Chicago had just issued a stay-at-home order, and the coronavirus pandemic seemed to permeate every aspect of life. But otherwise, its absolut… [+13152 chars]"}],"Thebaffler":[{"source":{"id":null,"name":"Thebaffler.com"},"author":"https://www.facebook.com/TheBafflerMagazine","title":"I'm Not Feeling Good At All","description":"For many young women laboring under the grindstone of American capitalism, the operative feeling of the last ten or fifteen years has not been numbness, but suffering.","url":"https://thebaffler.com/salvos/im-not-feeling-good-at-all-bergman","urlToImage":"https://thebaffler.com/wp-content/uploads/2020/02/B50_Bergman_opener.jpg","publishedAt":"2020-03-31T23:49:50Z","content":"The young woman works in an office. Her job is tedious: data entry, or coordinating the logistics for meaningless products, or proofreading niche trade publications with improbable names. She has no friends or resents the one she has. Her boyfriend is distant… [+23579 chars]"}],"Theringer":[{"source":{"id":null,"name":"Theringer.com"},"author":"The Ringer Staff","title":"The 50 Best Episodes Of 'The Office'","description":"It's not easy to trim down the list of the greatest installments of 'The Office,' but on the show's 15th anniversary, we gave it a shot.","url":"https://www.theringer.com/tv/2020/3/24/21191172/the-office-episodes-ranked-top-50","urlToImage":"https://cdn.vox-cdn.com/thumbor/LRGDtMGfcnP1AYVEvhl0vG24F6g=/0x24:1200x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19827815/office_best_eps_nbcu_ringer.jpg","publishedAt":"2020-03-24T12:21:27Z","content":"Fifteen years ago this Tuesday, cameras started rolling inside Dunder Mifflin, the most dysfunctionally run small paper company ever seen on television. Between then and now, The Office grew into one of the best modern comedies ever madefilled with excellentl… [+47578 chars]"}],"Bicycling":[{"source":{"id":null,"name":"Bicycling.com"},"author":"kim cross","title":"What Happens When Two Strangers Trust The Rides Of Their Lives To The Magic Of The Universe","description":"Leon had been riding west for 309 days. Noel had headed east for 176. Their meeting in the desert was a small miracle.","url":"https://www.bicycling.com/rides/a31245986/two-strangers-meet-bike-ride-journey/","urlToImage":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/img-1283-web-1584468626.jpg?crop=0.893xw:0.610xh;0.107xw,0.258xh&resize=1200:*","publishedAt":"2020-03-30T19:25:55Z","content":"Sometimes, their caravan met with another. One always had something that the other needed—as if everything were indeed written by one hand.As they sat around the fire, the camel drivers exchanged information about windstorms, andtold stories about the desert.… [+33718 chars]"}],"Oxfordamerican.org":[{"source":{"id":null,"name":"Oxfordamerican.org"},"author":"Emily Gogolak","title":"An Intersection At The End Of America","description":"A portrait of Dilley, Texas, home of the largest immigration detention center in the United States.","url":"https://www.oxfordamerican.org/magazine/item/1917-intersection-at-the-end-of-america","urlToImage":"https://www.oxfordamerican.org/media/k2/items/cache/2b9b72303a195511df58deb3249f170b_XS.jpg","publishedAt":"2020-03-20T19:29:33Z","content":"A portrait of Dilley, Texas, home of the largest immigration detention center in the United States\r\nReporting for this piece was supported by the Pulitzer Center.\r\nDear Dying Town,\r\n                The food is cheap; the squirrels are black; the box factories… [+66421 chars]"}],"Rollingstone":[{"source":{"id":null,"name":"Rollingstone.com"},"author":"Andrea Marks","title":"Jia Tolentino and the Art of Millennial Angst","description":"The author of 'Trick Mirror' on the clutches of success, controlling her internet habit, and learning to plan for the future","url":"https://www.rollingstone.com/culture/culture-features/jia-tolentino-interview-trick-mirror-962686/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2020/03/R1337_WOMEN_Jiatolentino.jpg","publishedAt":"2020-03-08T12:00:01Z","content":"Whenever she’s working on an essay, Jia Tolentino pretends nobody will read it. “I don’t know if it’s a self-protective impulse, or like a chip missing, but I tend to only think about making myself happy,” she says. “The reward is satisfying whatever itch mad… [+10594 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Brian Hiattt","title":"Grimes: Live From the Future","description":"The real life and fantastic visions of a digital warrior","url":"https://www.rollingstone.com/music/music-features/grimes-rolling-stone-digital-cover-960843/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2020/03/Grimes_RollingStone_LEAD.jpg","publishedAt":"2020-03-05T13:00:59Z","content":"Charlotte Rutherford for Rolling Stone\r\n1:45 p.m. on a Thursday, and Claire Boucher just woke up. She didn’t sleep well. Twenty-six-weeks pregnant, the arc of her belly currently nudging against a black Marvel Comics T-shirt, she had the distinct feeling last… [+28699 chars]"}],"Stereogum":[{"source":{"id":null,"name":"Stereogum.com"},"author":"Michael Tedder","title":"The My Generation: An Oral History Of Myspace Music","description":"All Gareth David wanted to do was find a few friends. And if they were into indie rock, so much the better. He had just enrolled at Cardiff University, and he didn't know anyone at all. Fortunately, he had just discovered Myspace right before heading out to u…","url":"https://www.stereogum.com/featured/myspace-music-oral-history/","urlToImage":"https://static.stereogum.com/uploads/2019/08/myspace-1566836279-1250x1000.jpeg","publishedAt":"2020-03-30T15:08:10Z","content":"All Gareth David wanted to do was find a few friends. And if they were into indie rock, so much the better. He had just enrolled at Cardiff University, and he didn’t know anyone at all. Fortunately, he had just discovered Myspace right before heading out to u… [+77846 chars]"}],"Oreilly":[{"source":{"id":null,"name":"Oreilly.com"},"author":"Hugo Bowne-Anderson","title":"The unreasonable importance of data preparation","description":"In a world focused on buzzword-driven models and algorithms, you’d be forgiven for forgetting about the unreasonable importance of data preparation and quality: your models are only as good as the data you feed them. This is the garbage in, garbage out princi…","url":"https://www.oreilly.com/radar/the-unreasonable-importance-of-data-preparation/","urlToImage":"https://www.oreilly.com/radar/wp-content/uploads/sites/3/2020/03/fotf-big-data-41a-1400x950-1.jpg","publishedAt":"2020-03-24T10:00:00Z","content":"Edit note: We know data preparation requires a ton of work and thought. In this provocative article, Hugo Bowne-Anderson provides a formal rationale for why that work matters, why data preparation is particularly important for reanalyzing data, and why you sh… [+18184 chars]"}],"Qz":[{"source":{"id":null,"name":"Qz.com"},"author":"Khe Hy","title":"An anonymous blogger wants to solve your biggest money mysteries","description":"When it comes to personal finance, Sam Dogen is not a household name. Why does his Financial Samurai blog attract millions of readers each month?","url":"https://qz.com/1772211/a-fire-movement-devotee-runs-an-anonymous-financial-blog/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/09/02_FOR_SAMURAI.jpg?quality=75&strip=all&w=1400","publishedAt":"2020-03-03T15:00:29Z","content":"For many of us raised to function in polite society, the most inflammatory thing to talk about is not politics or religionits money. Mainstream publications have tailored their coverage to sate readers thirst for this taboo subject: The New York Times What Yo… [+9552 chars]"}],"Refinery29":[{"source":{"id":null,"name":"Refinery29.com"},"author":"Refinery29, also written by Refinery29","title":"A Week In Toronto, ON, On A $135,000 Joint Income","description":"Welcome to Money Diaries, where we’re tackling what might be the last taboo facing modern working women: money. We’re asking millennials how they spend their hard-earned money during a seven-day period — and we’re tracking every last dollar. How is COVID-19 a…","url":"https://www.refinery29.com/en-ca/administrative-assistant-toronto-salary-money-diary","urlToImage":"https://www.refinery29.com/images/9595977.jpg?crop=40%3A21","publishedAt":"2020-03-30T12:00:32Z","content":"Editor's note: This Money Diary was written just as the coronavirus was declared a pandemic. Go to the Public Health Agency of Canada website for the latest information on symptoms, prevention, and other resources.Occupation: Administrative AssistantIndustry:… [+1380 chars]"},{"source":{"id":null,"name":"Refinery29.com"},"author":"You, also written by You","title":"A Week Of Being Unemployed In The Rocky Mountains, AB","description":"Welcome to Money Diaries, where we’re tackling what might be the last taboo facing modern working women: money. We’re asking millennials how they spend their hard-earned money during a seven-day period — and we’re tracking every last dollar. Attention, Canadi…","url":"https://www.refinery29.com/en-ca/unemployed-travel-blogger-rocky-mountains-salary-money-diary","urlToImage":"https://www.refinery29.com/images/9429211.jpg?crop=40%3A21","publishedAt":"2020-03-02T13:00:18Z","content":"Today: An unemployed travel blogger who spends some of her money this week on snow pants.Occupation: (F)unemployed/travel bloggerAge: 28Location: The Rocky Mountains, AB (I'm travelling in western Canada and spend most of this week near Banff.)Salary: $0 (I'm… [+494 chars]"}],"Yahoo":[{"source":{"id":null,"name":"Yahoo.com"},"author":"Kirsten Korosec","title":"Waymo brings in $2.25 billion from outside investors, Alphabet","description":"Waymo, the former Google self-driving car project that is now a business under Alphabet, said Monday it raised $2.25 billion in a fundraising round led by Silver Lake, Canada Pension Plan Investment Board, and Mubadala Investment Company. This is the company'…","url":"https://finance.yahoo.com/news/waymo-brings-2-25-billion-215812274.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/ZZ.2.sDsOlcaHSAv8hNyNw--~B/aD01MzQ2O3c9OTUwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/5513d377ea15b64ec76e0dc79391a9cf","publishedAt":"2020-03-02T21:58:12Z","content":"Waymo, the former Google self-driving car project that is now a business under Alphabet, said Monday it raised $2.25 billion in a fundraising round led by Silver Lake, Canada Pension Plan Investment Board, and Mubadala Investment Company.\r\nThis is the company… [+2779 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Manish Singh","title":"Amazon rolls out Alexa-powered voice shopping experience in India","description":"Amazon today rolled out Alexa-enabled voice-powered shopping feature in India as the e-commerce giant looks for new ways to engage with customers in one of its key overseas markets. This is the first time Amazon is bringing this feature outside of the U.S., t…","url":"https://finance.yahoo.com/news/amazon-rolls-alexa-powered-voice-152202913.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/._kXlV0WaB4y7TffDnUHMw--~B/aD0zNDY3O3c9NTIwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/0ea8385ddb6f963eeff8ca1e9bec4055","publishedAt":"2020-03-12T15:22:02Z","content":"Amazon today rolled out Alexa-enabled voice-powered shopping feature in India as the e-commerce giant looks for new ways to engage with customers in one of its key overseas markets.\r\nThe American giant said the feature, currently rolling out to Android users,… [+1762 chars]"}],"Nybooks":[{"source":{"id":null,"name":"Nybooks.com"},"author":"Nadja Spiegelman","title":"As Clean as Rage","description":"Virginie Despentes’s earlier pulp novels are revolutionary and furious, but they never aspired to greatness—they are intentionally trash (and perhaps unintentionally heavy-handed). Vernon Subutex 1 is grander in its ambition, but it sprawls,","url":"https://www.nybooks.com/articles/2020/04/23/virginie-despentes-clean-as-rage/","urlToImage":"https://cdn.nybooks.com/wp-content/uploads/2020/03/spiegelman_1_042320.jpg","publishedAt":"2020-04-02T07:00:24Z","content":"by Virginie Despentes, translated from the French by Frank Wynne\r\nFarrar, Straus and Giroux, 340 pp., $16.00 (paper)\r\nJF PagaVirginie Despentes, 2014\r\nParis at night in 1994, shaky footage on fast-forward. The camera rushes up the cobblestone side streets ont… [+29309 chars]"}],"Thewirecutter":[{"source":{"id":null,"name":"Thewirecutter.com"},"author":"Elissa Sanci","title":"The 7 Best Deals We’ve Found for $27 or Less","description":"The Wirecutter Deals team scans the virtual aisles of the Internet, searching for great discounts on Wirecutter-recommended products so you don’t have to. In our deal blog posts (like this one), we highlight the discounts that we think Wirecutter readers will…","url":"https://thewirecutter.com/money/deals-under-27/","urlToImage":"https://cdn.thewirecutter.com/wp-content/uploads/2020/03/dealsunder27-lowres-2-630x420.jpg","publishedAt":"2020-03-12T17:24:17Z","content":"Even the tightest budget has a little wiggle room for a few good buysand just because youre watching your wallet doesnt mean there arent things you need (or even just want really badly). Thats why our squad of Wirecutter Deals staffers has tirelessly poured t… [+6421 chars]"},{"source":{"id":null,"name":"Thewirecutter.com"},"author":"Elissa Sanci","title":"It’s Cold Outside. Spend a Cozy Night In with These Deals Instead","description":"The Wirecutter Deals team scans the virtual aisles of the Internet, searching for great discounts on Wirecutter-recommended products so you don’t have to. In our deal blog posts (like this one), we highlight the discounts that we think Wirecutter readers will…","url":"https://thewirecutter.com/money/deals-to-keep-cozy/","urlToImage":"https://cdn.thewirecutter.com/wp-content/uploads/2020/03/dutchoven-lowres-3799-570x380.jpg","publishedAt":"2020-03-02T18:55:06Z","content":"The groundhog may have predicted an early spring, but in some parts of the country, warm weather couldnt feel further away. With colder temperatures stubbornly sticking around, snow in the forecast, and an increase in the number of coronavirus cases in the US… [+6255 chars]"}],"The-sun":[{"source":{"id":null,"name":"The-sun.com"},"author":"Natalia Penza","title":"Cops forced to break up orgy during lockdown...","description":"Cops forced to break up orgy during lockdown... (Second column, 8th story, link )","url":"http://www.the-sun.com/news/591807/spanish-cops-forced-to-break-up-orgy-during-coronavirus-lockdown/","urlToImage":"https://www.the-sun.com/wp-content/uploads/sites/6/2020/03/NINTCHDBPICT000573266899-2.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2020-03-26T11:52:37Z","content":"SPANISH police have arrested eight people accused of flouting the coronavirus lockdown to organise a drug-fuelled orgy.\r\nUndercover cops in Barcelona nicked the randy revellers as they prepared to romp at a holiday flat during the country's strict Covid-19 cu… [+3476 chars]"}],"Thesun.co.uk":[{"source":{"id":null,"name":"Thesun.co.uk"},"author":"Natasha Clark","title":"British Army on standby as Boris declares war on virus...","description":"British Army on standby as Boris declares war on virus... (Second column, 4th story, link ) Related stories: Homeland Security Offices Closed in Washington State After Employee Falls Ill... NY man with coronavirus recently traveled to Miami, and Florida didn'…","url":"http://www.thesun.co.uk/news/11086449/army-on-standby-coronavirus-boris-johnson/","urlToImage":"https://www.thesun.co.uk/wp-content/uploads/2020/03/dk-comp-public-health-v13.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2020-03-03T17:13:45Z","content":"THE NUMBER of British coronavirus cases leapt to 51 today - moments after Boris Johnson revealed his battle plan to kill off the deadly bug in the UK.\r\nSoldiers could be deployed to guard vital sites so the police are free to deal with \"maintaining public ord… [+14670 chars]"}],"Pickthebrain":[{"source":{"id":null,"name":"Pickthebrain.com"},"author":"Maxim Dsouza","title":"How To Stop Measuring Yourself By Comparing with Others","description":"You're reading How To Stop Measuring Yourself By Comparing with Others, originally posted on Pick the Brain | Motivation and Self Improvement. If you're enjoying this, please visit our site for more inspirational articles. Do you think a hike in your salary w…","url":"https://www.pickthebrain.com/blog/how-to-stop-measuring-yourself-by-comparing-with-others/","urlToImage":"https://www.pickthebrain.com/blog/wp-content/uploads/2020/03/Screen-Shot-2020-03-29-at-7.44.29-PM.png","publishedAt":"2020-03-30T01:45:38Z","content":"Do you think\r\na hike in your salary would make you happy? You believe so, don’t you? But hold\r\non to that thought. There is more to it than just the percentage increase.\r\nFor 2 years,\r\nI observed a team of people. They exhibited a peculiar behavior after annu… [+5341 chars]"}],"Davidbordwell.net":[{"source":{"id":null,"name":"Davidbordwell.net"},"author":"bordwellblog","title":"Stuck inside these four walls: Chamber cinema for a plague year","description":"The Bitter Tears of Petra von Kant (1972). Privacy is the seat of Contemplation, though sometimes made the recluse of Tentation… Be you in your Chambers or priuate Closets; be you retired from the eyes of men; thinke how the eyes of God are on you. Doe not sa…","url":"http://www.davidbordwell.net/blog/2020/04/01/stuck-inside-these-four-walls-chamber-cinema-for-a-plague-year/","urlToImage":"http://www.davidbordwell.net/blog/wp-content/uploads/Bitter-700.jpg","publishedAt":"2020-04-01T14:20:34Z","content":"The Bitter Tears of Petra von Kant (1972).\r\nPrivacy is the seat of Contemplation, though sometimes made the recluse of Tentation Be you in your Chambers or priuate Closets; be you retired from the eyes of men; thinke how the eyes of God are on you. Doe not sa… [+16999 chars]"}],"Mint":[{"source":{"id":null,"name":"Mint.com"},"author":"Nicholas Pell","title":"5 Different Types of Insurance Policies & Coverage That You Need","description":"There are an overwhelming amount of insurance options on the market. While thorough coverage is important, it’s also possible that you can have too much coverage. Paying too much money for insurance could leave you financially vulnerable in other areas,... Fu…","url":"https://blog.mint.com/planning/the-5-basic-insurance-policies-everyone-should-have-0213/","urlToImage":"https://blog.mint.com/wp-content/uploads/2013/02/1.jpg?resize=1200,630","publishedAt":"2020-03-03T16:49:00Z","content":"There are an overwhelming amount of insurance options on the market. While thorough coverage is important, its also possible that you can have too much coverage. Paying too much money for insurance could leave you financially vulnerable in other areas, like y… [+10858 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Mint.com","title":"11 Money-Saving Tips for New or Expecting Parents (+ Printables)","description":"Having a baby is one of the most exciting times as a family. From your daily routine to your bank account, babies change just about everything. And as a parent, you want the best for your growing baby. You want... Full Story The post 11 Money-Saving Tips for …","url":"https://blog.mint.com/family/money-saving-tips-for-new-or-expecting-parents/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/03/New-Parent-Printables-Hero-Image.jpeg?resize=1200,630","publishedAt":"2020-03-13T14:36:27Z","content":"Having a baby is one of the most exciting times as a family. From your daily routine to your bank account, babies change just about everything. And as a parent, you want the best for your growing baby. You want them to have the future of their dreams and help… [+9154 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Holly Parker","title":"Budgeting Calculator","description":"Our free budget calculator can help you get a more complete picture of your monthly finances, providing insights into where you’re doing the most of your spending (and where you might want to cut back!). Enter the required information into... Full Story The p…","url":"https://blog.mint.com/budgeting/budgeting-calculator/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/02/5.png?resize=1200,630","publishedAt":"2020-03-04T21:28:48Z","content":"Our free budget calculator can help you get a more complete picture of your monthly finances, providing insights into where youre doing the most of your spending (and where you might want to cut back!).\r\nEnter the required information into the appropriate fie… [+9669 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Elle Martinez","title":"How 4 Moms are Gaining Financial Security Through Side Hustles","description":"If you're thinking about a side-hustle but are unsure how to start, here are four moms who have transformed their family's finances. Full Story The post How 4 Moms are Gaining Financial Security Through Side Hustles appeared first on MintLife Blog.","url":"https://blog.mint.com/family/how-4-moms-are-gaining-financial-security-through-side-hustles/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/03/women-with-side-hustles.jpg?resize=1200,630","publishedAt":"2020-03-06T01:41:31Z","content":"While the traditional 9-5 office model is slow to adapt to the needs of modern parents, some moms and dads are taking matters into their own hands. They are looking at ways to earn extra income while having flexibility in their schedules, including finding a … [+5120 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Mint.com","title":"How Many Credit Cards Should I Have?","description":"How many credit cards should a consumer have? The options range from zero to as many as you can get your hands on. See what one insider has to say about what the optimal number of credit cards is. Full Story The post How Many Credit Cards Should I Have? appea…","url":"https://blog.mint.com/credit/how-many-credit-cards-should-i-have/","urlToImage":"https://blog.mint.com/wp-content/uploads/2012/05/How-many-credit-cards-should-I-have.jpeg?resize=1200,630","publishedAt":"2020-03-27T12:34:35Z","content":"Theres no perfect answer to how many credit cards you should have. In general, if youre looking to build good credit, its a good idea to have at least one or two credit cards.\r\nAccording to a 2019 report from Experian, the average American has four credit car… [+3934 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Mint.com","title":"What is Fedloan Servicing? (Guide to Fedloan Student Loans)","description":"There you are, sitting in your high school’s guidance office talking with your counselor about heading off to college after graduation. You’re all excited thinking about the new friends and freedom you’ll have until you go home to parents who... Full Story Th…","url":"https://blog.mint.com/student-finances/what-is-fedloan-servicing/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/03/shutterstock_522554425.jpg?resize=1200,630","publishedAt":"2020-03-10T17:06:13Z","content":"There you are, sitting in your high schools guidance office talking with your counselor about heading off to college after graduation. Youre all excited thinking about the new friends and freedom youll have until you go home to parents who remind you that col… [+20409 chars]"}],"Fool":[{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Danny Vena)","title":"Alphabet's Self-Driving Car Segment Waymo Just Raised Billions From Outside Investors","description":"The Google parent is seeking outside funding for some of its vaunted \"other bets.\"","url":"https://www.fool.com/investing/2020/03/03/alphabet-self-driving-car-waymo-raised-billions.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/561285/waymo-waymovia-truck.jpg","publishedAt":"2020-03-03T21:41:45Z","content":"Alphabet's (NASDAQ:GOOGL)(NASDAQ:GOOG) self-driving car segment Waymo announced in a blog post on Monday that it had raised a massive $2.5 billion during its first external investment round.\r\nEarly investors in the autonomous vehicle company were led by Silve… [+1880 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Catherine Brock)","title":"4 Ways to Supplement Your Social Security Income","description":"When your monthly benefit isn't going to support you, it's time to get creative.","url":"https://www.fool.com/investing/2020/03/11/4-ways-to-supplement-your-social-security-income.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/554895/gettyimages-1072617868.jpg","publishedAt":"2020-03-11T14:01:00Z","content":"It's tough to work with insufficient resources. If you don't put enough gas in the car, you may have to walk home. If you don't drink enough water, you get dizzy and dehydrated. And if you don't have enough income to cover your living expenses, you could rack… [+5168 chars]"}],"Amitness":[{"source":{"id":null,"name":"Amitness.com"},"author":"Amit Chaudhary","title":"Semi-Supervised Learning: 85% accuracy on CIFAR-10 with only 10 labeled images","description":"Learn how to leverage unlabeled data using FixMatch for semi-supervised learning","url":"https://amitness.com/2020/03/fixmatch-semi-supervised/","urlToImage":"https://amitness.com/images/fixmatch-pipeline.png","publishedAt":"2020-04-03T14:16:06Z","content":"Deep Learning has shown very promising results in the field of Computer Vision. But when applying it to practical domains such as medical imaging, lack of labeled data is a major challenge. \r\nIn practical settings, labeling data is a time consuming and expens… [+13164 chars]"}],"USA Today":[{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, USA TODAY","title":"Coronavirus live updates: Cloth masks in public recommended; US retailers limit store access; FEMA sends medical supplies","description":"As the nation continues to grapple with the crisis, retailers are limiting how many shoppers can enter stores to encourage social distancing.","url":"https://www.usatoday.com/story/nletter/health/2020/04/04/coronavirus-updates-cdc-cloth-masks-public-us-stores-fema-ppe/2944992001/","urlToImage":"https://www.gannett-cdn.com/presto/2020/04/04/USAT/c673955a-4f49-443b-ac9e-1722edc177c8-AP20094644238345.jpg?crop=1023,576,x0,y52&width=1600&height=800&fit=bounds","publishedAt":"2020-04-04T10:23:14Z","content":"The U.S. death toll from the coronavirus marched to another record-setting pace early Saturday, with nearly 1,200 deaths in 24 hours as federal emergency workers tried to answer desperate pleas for respirators from dozens of states.\r\nMany traditions of Americ… [+6466 chars]"}],"Jezebel":[{"source":{"id":null,"name":"Jezebel.com"},"author":"Maria Sherman","title":"Your Weirdest Childhood Habit","description":"One of my all-time favorite Pissing Contest topics arrived in early 2015. (Can you even believe such a year existed?) Jezebel’s beloved former managing editor Madeleine Davies requested commenters share the “funniest, weirdest” thing they did in childhood, an…","url":"https://jezebel.com/your-weirdest-childhood-habit-1842565036","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/axzw2e5a5hg2kol6vetv.jpg","publishedAt":"2020-04-03T22:00:00Z","content":"One of my all-time favorite Pissing Contest topics arrived in early 2015. (Can you even believe such a year existed?) Jezebels beloved former managing editor Madeleine Davies requested commenters share the funniest, weirdest thing they did in childhood, and I… [+6209 chars]"}],"Vimeo":[{"source":{"id":null,"name":"Vimeo.com"},"author":null,"title":"IN LIMBO / NYC","description":"IN LIMBO is a visual, abstract exploration of New York City as a relict, void of people. Skyscrapers, iconic streets and bridges left sitting - just like old tug boats, dumped in Staten Island, visually representing the uncertainty and panic during a pandemic…","url":"https://vimeo.com/398127267","urlToImage":"https://i.vimeocdn.com/filter/overlay?src0=https%3A%2F%2Fi.vimeocdn.com%2Fvideo%2F870535942_1280x533.jpg&src1=https%3A%2F%2Ff.vimeocdn.com%2Fimages_v6%2Fshare%2Fplay_icon_overlay.png","publishedAt":"2020-03-31T14:07:16Z","content":null}],"Howsweeteats":[{"source":{"id":null,"name":"Howsweeteats.com"},"author":"Jessica","title":"What I Read In March 2020.","description":"Wow. This was such a weird month. When everything first started happening, I had a hard time focusing on reading. I couldn’t concentrate or really get into my book. And then I had a hard time choosing new books after I finished one, so I ended up forcing myse…","url":"https://www.howsweeteats.com/2020/04/what-i-read-in-march-2020/","urlToImage":"https://www.howsweeteats.com/wp-content/uploads/2020/04/march-reads-660x839.jpg","publishedAt":"2020-04-02T10:45:22Z","content":"by Jessica on April 2, 2020 01\r\nWow. This was such a weird month. When everything first started happening, I had a hard time focusing on reading. I couldn’t concentrate or really get into my book. And then I had a hard time choosing new books after I finished… [+4002 chars]"}],"Thoughtcatalog":[{"source":{"id":null,"name":"Thoughtcatalog.com"},"author":"Jordan Windnagle","title":"The Most Debated Mystery Of Our Time: The Disappearance Of Maura Murray","description":"The disappearance of Maura Murray is perhaps the most highly speculated case of the 21st century. It’s been called the \"the first crime mystery of the social media age\" due to Facebook’s launch 5 days before she went missing.","url":"https://thoughtcatalog.com/jordan-windnagle/2020/03/the-most-debated-mystery-of-our-time-the-disappearance-of-maura-murray/","urlToImage":"https://thoughtcatalog.files.wordpress.com/2020/03/missing_student_28185-1-e1549711918775.jpg?w=1200&resize=1200,777&quality=95&strip=all&crop=1","publishedAt":"2020-03-17T23:24:43Z","content":"The disappearance of Maura Murray is perhaps the most highly speculated case of the 21st century. Its been called the “the first crime mystery of the social media age” due to Facebooks launch 5 days before she went missing. There are numerous podcasts, websit… [+11879 chars]"},{"source":{"id":null,"name":"Thoughtcatalog.com"},"author":"Jordan Windnagle","title":"7 Mysterious Cases That Will Take You Down The Rabbit Hole","description":"Since we’re all getting stir crazy, why not discuss mysteries that involve eerie isolation with a touch of mass hysteria?","url":"https://thoughtcatalog.com/jordan-windnagle/2020/03/7-mysterious-cases-that-will-take-you-down-the-rabbit-hole/","urlToImage":"https://thoughtcatalog.files.wordpress.com/2020/03/dyatlov_pass_incident_02.jpg?resize=809,640&quality=95&strip=all&crop=1","publishedAt":"2020-03-25T18:15:42Z","content":"Since were all getting stir crazy, why not discuss mysteries that involve eerie isolation with a touch of mass hysteria? These seven perplexing cases are sure to take your mind off the current situation.\r\nThe Lead Masks Case\r\nOn August 20, 1966, the bodies of… [+12581 chars]"}]}