{"Lifehacker":[{"source":{"id":null,"name":"Lifehacker.com"},"author":"Jaclyn Youhana Garver on Offspring, shared by Jaclyn Youhana Garver to Lifehacker","title":"The Best Ways to Store Stuffed Animals","description":"It’s a go-to gift from so many well-meaning folks. They’re soft! They’re fluffy! They’re cute! But before you know it, your child has approximately 147 stuffed animals—toys that defy stacking, that can really only be heaped precariously until the slightest nu…","url":"https://offspring.lifehacker.com/the-best-ways-to-store-stuffed-animals-1842095966","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bvp3vipaq5dxwp0xz1wp.jpg","publishedAt":"2020-03-06T19:00:00Z","content":"Its a go-to gift from so many well-meaning folks. Theyre soft! Theyre fluffy! Theyre cute! But before you know it, your child has approximately 147 stuffed animalstoys that defy stacking, that can really only be heaped precariously until the slightest nudge s… [+5036 chars]"}],"Androidcentral":[{"source":{"id":null,"name":"Androidcentral.com"},"author":"Quentyn Kennemer","title":"Ghost of Tsushima brings beautiful samurai sword-fighting to the PS4","description":"Samurai sword-fighting has never been prettier. Ghost of Tsushima is the first non-Infamous game from Sucker Punch Productions since 2005. While there's a lot of questions still about just what kind of game it is, here's everything we know about Ghost of Tsus…","url":"https://www.androidcentral.com/ghost-tsushima","urlToImage":"https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2018/06/ghost%20of%20tsushima%20screenshots%20_8__0.jpg?itok=SOcvcMvT","publishedAt":"2020-03-12T17:00:00Z","content":"Source: Sony\r\nGhost of Tsushima is the first non-Infamous game from Sucker Punch Productions since 2005. While there's a lot of questions still about just what kind of game it is, here's everything we know about Ghost of Tsushima.\r\nWar-torn land\r\nThe way of t… [+9462 chars]"}],"Makezine":[{"source":{"id":null,"name":"Makezine.com"},"author":"Caleb Kraft","title":"Open Source Hardware Certifications For February 2020","description":"The Open Source Hardware Association (OSHWA) runs a free program that allows creators to certify that their hardware complies with the community definition of open source hardware. Whenever you see the certification logo, you know that the certified hardware …","url":"https://makezine.com/2020/03/10/open-source-hardware-certifications-for-february-2020/","urlToImage":"https://i1.wp.com/makezine.com/wp-content/uploads/2020/03/feboshw-06.jpg?fit=1920%2C1080&ssl=1","publishedAt":"2020-03-10T15:00:17Z","content":"The Open Source Hardware Association (OSHWA) runs a free program that allows creators to certify that their hardware complies with the community definition of open source hardware.  Whenever you see the certification logo, you know that the certified hardware… [+5896 chars]"}],"Business Insider":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Shanna Goodman","title":"I'm a brand strategy expert who reads 50 to 70 books every year. These are the 7 most essential books to read this year to grow your business.","description":"Shanna Goodman has worked with hundreds of small businesses over the last 15 years. She is an avid reader and says it helps her better advise clients. Read the books in the order they're listed, and use them as a framework to determine why and how to grow you…","url":"https://www.businessinsider.com/7-most-essential-books-to-read-for-business-growth","urlToImage":"https://i.insider.com/5e6a75f6e4f9fe0dcf6e6f26?width=1200&format=jpeg","publishedAt":"2020-03-12T20:00:35Z","content":null}],"Inquirer":[{"source":{"id":null,"name":"Inquirer.com"},"author":"Nick Vadala","title":"What you need to know about homemade face masks: Do they work? Are hospitals using them? - The Philadelphia Inquirer","description":"What you need to know about homemade face masks: Do they work? Are hospitals using them? The Philadelphia Inquirer As virus explodes, world races to mask up Reuters I treat coronavirus patients. I worry about infecting my colleagues — or my kids. The Washingt…","url":"https://www.inquirer.com/health/coronavirus/homemade-masks-coronavirus-do-they-work-how-to-make-them-20200324.html","urlToImage":"https://www.inquirer.com/resizer/i4dF5iABThGKUi0y9TmBhUeiXCs=/1200x0/center/middle/www.inquirer.com/resizer/y_d7orJVITICRElpCJ53QaId9tg=/1200x0/center/middle/arc-anglerfish-arc2-prod-pmn.s3.amazonaws.com/public/JUEZYFME7NGCLAHYS6ZKAYYDI4.jpg","publishedAt":"2020-03-24T21:13:27Z","content":"As medical workers face a shortage of personal protective equipment in the ongoing fight against COVID-19, some crafters are pitching in.\r\nOften constructed simply of materials like cotton fabric and elastic, DIY face masks are all over the internet right now… [+8548 chars]"}],"Boingboing.net":[{"source":{"id":null,"name":"Boingboing.net"},"author":"Gareth Branwyn","title":"Attention shut-in chaos cultists: Chaosium releases \"Call of Cthulhu The Coloring Book\" as a free download","description":"In an effort to stave off boredom during the great quarantine of 2020, our pals over at Chaosium have made their award-winning Call of Cthulhu The Coloring Book available as a free download. They've also announced a Call of Cthulhu The Coloring Book coloring …","url":"https://boingboing.net/2020/03/16/attention-shut-in-chaos-cultis.html","urlToImage":"https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/cha5116-coloring-book-front-cover-46567.1480376842.500.659-1-.jpg?fit=500%2C647&ssl=1","publishedAt":"2020-03-17T00:55:38Z","content":"James Floyd Kelly runs the excellent Tabletop Engineer channel on YouTube and Bexim’s Bazaar, a monthly tabletop gaming magazine (to which I often contribute a game-crafting column). Like me, Jim was a lover of 80s roleplaying game fanzines. Unlike me, he’s d… [+2033 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Boing Boing's Shop","title":"This creative writing training will help you become a literary wordsmith","description":"Creative writing can be a nerve-racking endeavor. It’s just you, your thoughts and that very, very blank page or word doc. You might have an idea for the story you want to tell, but what form does that story take? A novel? A short story? An article? Maybe eve…","url":"https://boingboing.net/2020/03/13/this-creative-writing-training.html","urlToImage":"https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/product_36547_product_shots1.jpg?fit=630%2C473&ssl=1","publishedAt":"2020-03-14T02:00:47Z","content":"Creative writing can be a nerve-racking endeavor. Its just you, your thoughts and that very, very blank page or word doc. You might have an idea for the story you want to tell, but what form does that story take? A novel? A short story? An article? Maybe even… [+3716 chars]"}],"Hackaday":[{"source":{"id":null,"name":"Hackaday.com"},"author":"Tom Nardi","title":"Prusa Advises on Printed Medical Devices, Releases Face Shield","description":"Like everyone else, hackers and makers want to do something to help control the spread of COVID-19. The recent posts on Hackaday dealing with DIY and open source approaches to respirators, ventilators, and masks have been some of the most widely read and comm…","url":"https://hackaday.com/2020/03/20/prusa-advises-on-printed-medical-devices-releases-face-shield/","urlToImage":"https://hackaday.com/wp-content/uploads/2020/03/prusacovid_feat.jpg","publishedAt":"2020-03-20T15:01:08Z","content":"Like everyone else, hackers and makers want to do something to help control the spread of COVID-19. The recent posts on Hackaday dealing with DIY and open source approaches to respirators, ventilators, and masks have been some of the most widely read and comm… [+2456 chars]"}],"Huffpost":[{"source":{"id":null,"name":"Huffpost.com"},"author":"Kristen Aiken","title":"How To Make A Face Mask That Is Effective Against Coronavirus","description":"Here are DIY tutorials for homemade masks that protect against COVID-19, whether you're wearing a mask yourself or donating to hospitals.","url":"https://www.huffpost.com/entry/how-to-make-face-mask-coronavirus_l_5e78cb2fc5b6f5b7c5483e17","urlToImage":"https://img.huffingtonpost.com/asset/5e792d2d2400005d00cea259.png?ops=1778_1000","publishedAt":"2020-03-24T09:45:16Z","content":"In light of the coronavirus pandemic, face masks are in huge demand right now. Millions of masks are needed, and you can help.\r\nWhen asked to address a nationwide shortage of face masks on Saturday, the White House wasnt able to say when more health care work… [+6034 chars]"}],"Davidrevoy":[{"source":{"id":null,"name":"Davidrevoy.com"},"author":"David REVOY","title":"Kubuntu Linux 19.10 for a digital painting workstation: Reasons, Install guide","description":"Website of David Revoy (aka Deevad), artist and instructor using only Free/Libre and Open-Source software since 2009.","url":"https://www.davidrevoy.com/article761/kubuntu-linux-19-10-for-a-digital-painting-workstation-reasons-and-install-guide","urlToImage":"https://www.davidrevoy.com/data/images/blog/2020/kubuntu-guide/2020-03-11_kubuntu1910-0-header.jpg","publishedAt":"2020-03-11T20:51:56Z","content":"My assistant introducing my workstation running Kubuntu at home\r\nAs you probably knows if you follow my blog, I'm using exclusively a GNU/Linux operating system for my workstation. I produce everything I do with it (webcomic, website, book, freelance, videos,… [+28175 chars]"}],"Swiss-miss":[{"source":{"id":null,"name":"Swiss-miss.com"},"author":"swissmiss","title":"Link Pack","description":"– I virtually danced my heart out yesterday with The Get Down. It was just what I needed. Pure medicine. My friends in other cities joined, I pinned their video and felt like we were dancing together. I love the internet. – This is dedication: Talking Book, a…","url":"https://www.swiss-miss.com/2020/03/link-pack-38.html","urlToImage":"https://s0.wp.com/i/blank.jpg","publishedAt":"2020-03-27T13:49:58Z","content":"– I virtually danced my heart out yesterday with The Get Down. It was just what I needed. Pure medicine. My friends in other cities joined, I pinned their video and felt like we were dancing together. I love the internet. \r\n– This is dedication: Talking Book,… [+1733 chars]"}],"9to5mac":[{"source":{"id":null,"name":"9to5mac.com"},"author":"Michael Potuck","title":"HomeKit security system maker Abode launches redesigned app through beta program","description":"Abode, the company behind the first DIY HomeKit security system and other smart home products is out today with an all-new app that it is rolling out through its beta program. The Abode 5.0 for iOS and Android features a refreshed design with new features and…","url":"https://9to5mac.com/2020/03/04/homekit-security-system-maker-abode-launches-redesigned-app-through-beta-program/","urlToImage":"https://9to5mac.com/wp-content/uploads/sites/6/2020/03/abode-homekit-security-system-maker-app-beta.jpeg?resize=1024,512","publishedAt":"2020-03-04T16:41:24Z","content":"Abode, the company behind the first DIY HomeKit security system and other smart home products is out today with an all-new app that it is rolling out through its beta program. The Abode 5.0 for iOS and Android features a refreshed design with new features and… [+805 chars]"}],"Vice News":[{"source":{"id":"vice-news","name":"Vice News"},"author":"Zara Golden, Kate Dries","title":"American Apparel's Ousted CEO Is Still Here—and Making COVID Face Masks?","description":"Dov Charney's new retail company is one of several pivoting toward producing personal protective gear under unclear government guidelines.","url":"https://www.vice.com/en_us/article/7kzjae/american-apparels-ousted-ceo-is-still-hereand-making-covid-face-masks","urlToImage":"https://video-images.vice.com/test-uploads/articles/5e7bae1be01f750097722e3f/lede/1585164029456-Copy-of-Splitscreen-3.jpeg?crop=1xw:1xh;center,center&resize=1200:*","publishedAt":"2020-03-25T20:31:36Z","content":"Dov Charney is easy to get ahold of. He spends most of his waking hours in his manufacturing facility in South Central Los Angeles, where he keeps a humble room furnished with a twin-sized bed that adjoins the factory floor. And, perhaps somewhat surprisingly… [+10014 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Rachel Miller, Casey Johnston","title":"57 Things to Do With Friends While Social Distancing Beyond 'Catching Up'","description":"Time to get creative with all those Zoom calls.","url":"https://www.vice.com/en_us/article/3a8wb5/video-chat-socializing-friends-during-quarantine-isolation-coronavirus","urlToImage":"https://video-images.vice.com/test-uploads/articles/5e7e32d37d35fa009de24205/lede/1585338164654-50-ways-to-connect-with-friends-and-stave-off-crushing-loneliness-right-now_HF.jpeg?crop=1xw:1xh;center,center&resize=1200:*","publishedAt":"2020-03-28T13:00:00Z","content":"It looks like social distancing isnt going away any time soon. While this is good for our physical health and strained healthcare system, its not great for folks who are desperate for their daily dose of social connections, or anyone who is feeling really lon… [+8806 chars]"}],"Kk.org":[{"source":{"id":null,"name":"Kk.org"},"author":"claudia","title":"Refilling Your Own SodaStream Cartridges","description":"Gareth's Tips, Tools, and Shop Tales - Issue #37","url":"https://kk.org/cooltools/refilling-your-own-sodastream-cartridges/","urlToImage":"https://kk.org/cooltools/files/2020/02/basichousehold.jpeg","publishedAt":"2020-03-05T16:00:38Z","content":"Gareth's Tips, Tools, and Shop Tales - Issue #37\r\nThe latest issue of HackSpace magazine is out, issue 28 [Free PDF]. I have a piece in there (pgs 90-91) on tips and recommendations for improving shop organization and storage.***\r\nFor those here who might be … [+4731 chars]"}],"Diyphotography.net":[{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Adobe cancels NAB 2020 attendance due to coronavirus concerns","description":"After switching its annual Summit conference to an online event, Adobe is now also pulling out of NAB 2020. The reason is the same and it was probably expected: the coronavirus outbreak. According to Pro Video Coalition, Adobe has started notifying partners a…","url":"https://www.diyphotography.net/adobe-cancels-nab-2020-attendance-due-to-coronavirus-concerns/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/adobe-nab-2020-canceled.jpg.optimal.jpg","publishedAt":"2020-03-09T21:50:18Z","content":"After switching its annual Summit conference to an online event, Adobe is now also pulling out of NAB 2020. The reason is the same and it was probably expected: the coronavirus outbreak.\r\nAccording to Pro Video Coalition, Adobe has started notifying partners … [+1249 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Astrophotographers’ favorite Dark Sky app to become iPhone-only after Apple buys it up","description":"Dark Sky is a popular weather app among astrophotographers, but it’s soon to become unavailable for Android. Apple has acquired Dark Sky and as of July this year, it will become available for iPhone users only. Co-founder of Dark Sky Adam Grossman has announc…","url":"https://www.diyphotography.net/astrophotographers-favorite-dark-sky-app-to-become-iphone-only-after-apple-buys-it-up/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/04/dark-sky.jpg.optimal.jpg","publishedAt":"2020-04-01T10:12:28Z","content":"Dark Sky is a popular weather app among astrophotographers, but its soon to become unavailable for Android. Apple has acquired Dark Sky and as of July this year, it will become available for iPhone users only.\r\nCo-founder of Dark Sky Adam Grossman has announc… [+1270 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Keenan Rivals","title":"Do you know your top five photographs?","description":"How many people remember my interview with Eric Kim? This was a huge deal for me! I remember when I first started shooting street, his blog was one of the first that I came by. It was filled with so much information, but what was more interesting to me were t…","url":"https://www.diyphotography.net/do-you-know-your-top-five-photographs/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/top-five-photographs-scaled.jpg.optimal.jpg","publishedAt":"2020-03-10T16:55:34Z","content":"How many people remember my interview with Eric Kim? This was a huge deal for me! I remember when I first started shooting street, his blog was one of the first that I came by. It was filled with so much information, but what was more interesting to me were t… [+7622 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Saurabh Narang","title":"10 more suggestions for photographers who are out of work due to coronavirus","description":"Since the outbreak of COVID-19, the photography community is equally affected due to pandemic quarantining and social distancing. Every day, things are getting worse from assignments being called off to major photography events getting postponed. We all are v…","url":"https://www.diyphotography.net/10-more-suggestions-for-photographers-who-are-out-of-work-due-to-coronavirus/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/001-4.jpg.optimal.jpg","publishedAt":"2020-03-20T18:39:21Z","content":"Since the outbreak of COVID-19, the photography community is equally affected due to pandemic quarantining and social distancing. Every day, things are getting worse from assignments being called off to major photography events getting postponed. We all are v… [+3786 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Adobe Summit canceled over Coronavirus concerns, switched to online-only event","description":"After MWC, CP+ and several other trade shows and conferences, Adobe Summit 2020 is also being canceled due to the Coronavirus concerns. However, the organizers have found the way to still host the event. Instead of taking place at The Venetian Resort Hotel Ca…","url":"https://www.diyphotography.net/adobe-summit-canceled-over-coronavirus-concerns-switched-to-online-only-event/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/adobe-summit-online.jpg.optimal.jpg","publishedAt":"2020-03-04T11:03:16Z","content":"After MWC, CP+ and several other trade shows and conferences,  Adobe Summit 2020 is also being canceled due to the Coronavirus concerns. However, the organizers have found the way to still host the event. Instead of taking place at The Venetian Resort Hotel C… [+1296 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"John Aldred","title":"Watch what goes into really weather-sealing a camera in this in-depth behind the scenes video","description":"One of the most standout features of Olympus mirrorless cameras is just how well weather-sealed they are. You can practically hose them off to give them a good cleaning at the end of your day of shooting and they just keep on going. Not all camera systems far…","url":"https://www.diyphotography.net/watch-what-goes-into-really-weather-sealing-a-camera-in-this-in-depth-behind-the-scenes-video/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/olympus-weather-sealing.jpg.optimal.jpg","publishedAt":"2020-03-17T11:19:22Z","content":"One of the most standout features of Olympus mirrorless cameras is just how well weather-sealed they are. You can practically hose them off to give them a good cleaning at the end of your day of shooting and they just keep on going. Not all camera systems far… [+1516 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"John Aldred","title":"You can now send huge Creative Cloud assets with Gmail using this Adobe addon","description":"Adobe’s Creative Cloud is a wonderful tool for many photographers and filmmakers out there who want to get some remote backup of their work and easily transfer it between their devices. It’s also big on the collaboration features, with Adobe reporting over a …","url":"https://www.diyphotography.net/you-can-now-send-huge-creative-cloud-assets-with-gmail-using-this-adobe-addon/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/adobe-google.jpg.optimal.jpg","publishedAt":"2020-03-06T11:36:25Z","content":"Adobe’s Creative Cloud is a wonderful tool for many photographers and filmmakers out there who want to get some remote backup of their work and easily transfer it between their devices. It’s also big on the collaboration features, with Adobe reporting over a … [+1964 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Google Suite offers free streaming for everyone working from home during the coronavirus outbreak","description":"The coronavirus outbreak has made many people work, teach and study from home. To make this easier, Google Suite is now offering free access to advanced Hangouts Meet video-conferencing. If your work has moved online as well, you can take advantage of this of…","url":"https://www.diyphotography.net/google-suite-offers-free-streaming-for-everyone-working-from-home-during-the-coronavirus-outbreak/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/free-streaming-google-suite.jpg.optimal.jpg","publishedAt":"2020-03-24T10:05:41Z","content":"The coronavirus outbreak has made many people work, teach and study from home. To make this easier, Google Suite is now offering free access to advanced Hangouts Meet video-conferencing. If your work has moved online as well, you can take advantage of this of… [+1957 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Photographer creates goofy and emotional portraits of his friends in quarantine","description":"If you’ve been disciplined during the coronavirus outbreak, you probably haven’t seen your friends for a while. And if there’s one thing all of us in self-isolation have in common, it’s this: we miss out friends! Photographer Jared Gruenwald is one of us, and…","url":"https://www.diyphotography.net/photographer-creates-goofy-and-emotional-portraits-of-his-friends-in-quarantine/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/through_the_lockdown_glass_007.jpg.optimal.jpg","publishedAt":"2020-03-27T16:42:16Z","content":"If youve been disciplined during the coronavirus outbreak, you probably havent seen your friends for a while. And if theres one thing all of us in self-isolation have in common, its this: we miss out friends! Photographer Jared Gruenwald is one of us, and he … [+2988 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Allen Murabayashi","title":"How the kids are learning photography on TikTok","description":"TikTok, the video-based social media app, usually conjures visions of teens mimicking the latest dance craze, but it’s probably better described as short attention span YouTube. In 2017, ByteDance, the Chinese-owned parent company of TikTok, acquired the Musi…","url":"https://www.diyphotography.net/how-the-kids-are-learning-photography-on-tiktok/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/tiktok-photography.jpg.optimal.jpg","publishedAt":"2020-03-10T14:25:02Z","content":"TikTok, the video-based social media app, usually conjures visions of teens mimicking the latest dance craze, but its probably better described as short attention span YouTube. In 2017, ByteDance, the Chinese-owned parent company of TikTok, acquired the Music… [+3535 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Dunja Djudjic","title":"Huawei P40 series announced: Leica cameras, 10x optical zoom and the largest sensor to date","description":"Huawei has just announced three phones in the P40 series: Huawei P40, P40 Pro and P40 Pro+. Once again, Huawei has put the focus on the camera capabilities. All three versions of the latest flagship phone bring some improvements over the previous series. Sens…","url":"https://www.diyphotography.net/huawei-p40-series-announced-leica-cameras-10x-optical-zoom-and-the-largest-sensor-to-date/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/huawei-p40-745x347.jpg.optimal.jpg","publishedAt":"2020-03-27T12:18:24Z","content":"Huawei has just announced three phones in the P40 series: Huawei P40, P40 Pro and P40 Pro+. Once again, Huawei has put the focus on the camera capabilities. All three versions of the latest flagship phone bring some improvements over the previous series. Sens… [+5238 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Simon King","title":"Nothing touches, but everything is connected: Studying figure to ground in my composition","description":"Figure to ground means that a subject or idea (figure) is clearly defined against a background. This can be achieved through technical means, ie depth of field, or compositional means. My preferred method is to make sure that everything in my photographs fit …","url":"https://www.diyphotography.net/nothing-touches-but-everything-is-connected-studying-figure-to-ground-in-my-composition/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/cover.jpg.optimal.jpg","publishedAt":"2020-03-04T14:53:19Z","content":"Figure to ground means that a subject or idea (figure) is clearly defined against a background. This can be achieved through technical means, ie depth of field, or compositional means. My preferred method is to make sure that everything in my photographs fit … [+3895 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Saurabh Narang","title":"I am not a “self-taught” photographer","description":"“Meet my friend Saurabh, he’s an amazing photographer from India and his work has been published in various reputed newspapers and journals worldwide like NatGeo, The Guardian, Lonely Planet, etc. Astonishingly, he’s a self-taught photographer and very passio…","url":"https://www.diyphotography.net/i-am-not-a-self-taught-photographer/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/self-taught.jpeg","publishedAt":"2020-03-14T13:12:50Z","content":"Meet my friend Saurabh, hes an amazing photographer from India and his work has been published in various reputed newspapers and journals worldwide like NatGeo, The Guardian, Lonely Planet, etc. Astonishingly, hes a self-taught photographer and very passionat… [+5177 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Patrick Nugent","title":"11 more things photographers can do during coronavirus lockdown","description":"As a photography studio in NYC who specializes in all things in the corporate realm, we first started to see the ripple effects of the Coronavirus in early February when one of our clients cancelled a large global conference less than 5 days before it was sup…","url":"https://www.diyphotography.net/11-more-things-photographers-can-do-during-coronavirus-lockdown/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/004-1.jpg.optimal.jpg","publishedAt":"2020-03-19T15:24:16Z","content":"As a photography studio in NYC who specializes in all things in the corporate realm, we first started to see the ripple effects of the Coronavirus in early February when one of our clients cancelled a large global conference less than 5 days before it was sup… [+9525 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Allen Murabayashi","title":"How freelance photographers are dealing with the economic effects of coronavirus","description":"As fears of coronavirus (COVID-19) balloon in the U.S., many freelance photographers have begun to contend with the economic impact of event cancellations and social distancing policies. Freelancers are accustomed to seasonal slowdowns or the occasional cance…","url":"https://www.diyphotography.net/how-freelance-photographers-are-dealing-with-the-economic-effects-of-coronavirus/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/coronavirus-photographers.jpg.optimal.jpg","publishedAt":"2020-03-15T13:23:53Z","content":"As fears of coronavirus (COVID-19) balloon in the U.S., many freelance photographers have begun to contend with the economic impact of event cancellations and social distancing policies. Freelancers are accustomed to seasonal slowdowns or the occasional cance… [+7101 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Blair Bunting","title":"A Tale of Two 24-70’s: Nikkor S and G","description":"First, a little backstory to this piece… For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, let’s just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross…","url":"https://www.diyphotography.net/a-tale-of-two-24-70s-nikkor-s-and-g/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/nikons.jpg.optimal.jpg","publishedAt":"2020-03-10T11:21:56Z","content":"First, a little backstory to this piece For much of my young career, I shot Canon. Be it the 1D, 1D2, 1DS, 1D3, 1DS2 and 1DS3, lets just say I had a thing for the ergonomics of that chassis. In every camera I would replace the focusing screen with the cross-s… [+6947 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"Jeff Cable","title":"My Canon EOS 1D X Mark III real world review","description":"As many of you know, I have been lucky enough to have a Canon EOS 1DX Mark III in my possession for more than a month now. People have been asking me to review this new top-of-the-line camera, but I really wanted to put it through it’s paces in order to do a …","url":"https://www.diyphotography.net/my-canon-eos-1d-x-mark-iii-real-world-review/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2020/03/001-5.jpg.optimal.jpg","publishedAt":"2020-03-26T19:28:37Z","content":"As many of you know, I have been lucky enough to have a Canon EOS 1DX Mark III in my possession for more than a month now. People have been asking me to review this new top-of-the-line camera, but I really wanted to put it through it’s paces in order to do a … [+14953 chars]"}],"Dpreview":[{"source":{"id":null,"name":"Dpreview.com"},"author":"Kara Murphy, Gannon Burgett","title":"Photography deals, discounts and freebies for making the most of being stuck inside","description":"As the number of newly-diagnosed Coronavirus cases continues to increase, so do the strict orders to stay home. For some, this means an increase in free time along with a decline in disposable income. Across the photography community, multiple retailers, soft…","url":"https://www.dpreview.com/news/3505607911/photography-deals-discounts-and-freebies-for-making-the-most-of-being-stuck-inside","urlToImage":"https://4.img-dpreview.com/files/p/E~TS940x788~articles/3505607911/5147252155.jpeg","publishedAt":"2020-03-27T16:59:00Z","content":"As the number of newly-diagnosed Coronavirus cases continues to increase, so do the strict orders to stay home. For some, this means an increase in free time along with a decline in disposable income. Across the photography community, multiple retailers, soft… [+7960 chars]"}],"Jezebel":[{"source":{"id":null,"name":"Jezebel.com"},"author":"Maria Sherman","title":"I Finally Gave Into the World of YouTube Vlogs","description":"Many YouTubers have two channels. One is their bread and butter—if you’re a BeautTuber, it’s where all your makeup tutorials are posted, if you’re a DIY blogger, it’s where all your hack videos can be found. On the side is a vlog channel—an account with consi…","url":"https://jezebel.com/i-finally-gave-into-the-world-of-youtube-vlogs-1842617766","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i1ohuavakluvpwihjfnm.png","publishedAt":"2020-04-02T20:45:00Z","content":"Many YouTubers have two channels. One is their bread and butterif youre a BeautTuber, its where all your makeup tutorials are posted, if youre a DIY blogger, its where all your hack videos can be found. On the side is a vlog channelan account with considerabl… [+5730 chars]"}],"Thesimpledollar":[{"source":{"id":null,"name":"Thesimpledollar.com"},"author":"Trent Hamm","title":"Questions About Stocks, Discount Grocers, Toilet Paper, Credit Cards, Bottled Water and More","description":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question. 1. Staying put, but worried 2. Replacing bottles and boiling water 3. Frugal …","url":"https://www.thesimpledollar.com/reader-mailbag/questions-about-stocks-discount-grocers-toilet-paper-credit-cards-bottled-water-and-more/","urlToImage":"https://www.thesimpledollar.com/wp-content/uploads/2019/02/mailing-a-letter_t20_g8gOOa.jpg","publishedAt":"2020-03-16T12:00:48Z","content":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question.\r\n1. Staying put, but worried2. Replacing bottles and boiling water3. Frugal a… [+18052 chars]"}],"Hypebeast":[{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"Daily Paper on Family and Roots","description":"Hussein, Abderrahmane and Jefferson have known each other since they were in school. The Amsterdam-based trio behind Daily Paper have been working together since 2008, parlaying an online streetwear blog into an internationally recognized clothing label. As t…","url":"https://hypebeast.com/2020/4/hypebeast-magazine-daily-paper-interview","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2F000-HB28-Daily-Paper-twitter.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2020-04-02T18:19:13Z","content":"What is Daily Paper to you?Hussein:A company founded by friends. We represent the DIY generation. A global movement of underrepresented individuals that is making efforts to break stereotypes, especially those that are assigned to Black and African people. It… [+1012 chars]"}],"Petapixel":[{"source":{"id":null,"name":"Petapixel.com"},"author":"Dirk Essl","title":"How to Build a DIY ‘Pixelstick’ for About $22","description":"You might have heard of the Pixelstick. “Nothing compares” is one of their tag lines. And this is true… at least price-wise. I have always wanted one to at least try out some light painting with it, but the original Pixelstick retails for 400 Euro here in Ger…","url":"https://petapixel.com/2020/03/19/i-built-a-diy-pixelstick-for-about-22/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PetaPixel+%28PetaPixel%29","urlToImage":"https://petapixel.com/assets/uploads/2020/03/pixelstick_feat.jpg","publishedAt":"2020-03-19T18:31:31Z","content":"You might have heard of the Pixelstick. Nothing compares is one of their tag lines. And this is true… at least price-wise. I have always wanted one to at least try out some light painting with it, but the original Pixelstick retails for 400 Euro here in Germa… [+4413 chars]"}],"Rollingstone":[{"source":{"id":null,"name":"Rollingstone.com"},"author":"Brian Hiattt","title":"Grimes: Live From the Future","description":"The real life and fantastic visions of a digital warrior","url":"https://www.rollingstone.com/music/music-features/grimes-rolling-stone-digital-cover-960843/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2020/03/Grimes_RollingStone_LEAD.jpg","publishedAt":"2020-03-05T13:00:59Z","content":"Charlotte Rutherford for Rolling Stone\r\n1:45 p.m. on a Thursday, and Claire Boucher just woke up. She didn’t sleep well. Twenty-six-weeks pregnant, the arc of her belly currently nudging against a black Marvel Comics T-shirt, she had the distinct feeling last… [+28699 chars]"}],"Stereogum":[{"source":{"id":null,"name":"Stereogum.com"},"author":"Michael Tedder","title":"The My Generation: An Oral History Of Myspace Music","description":"All Gareth David wanted to do was find a few friends. And if they were into indie rock, so much the better. He had just enrolled at Cardiff University, and he didn't know anyone at all. Fortunately, he had just discovered Myspace right before heading out to u…","url":"https://www.stereogum.com/featured/myspace-music-oral-history/","urlToImage":"https://static.stereogum.com/uploads/2019/08/myspace-1566836279-1250x1000.jpeg","publishedAt":"2020-03-30T15:08:10Z","content":"All Gareth David wanted to do was find a few friends. And if they were into indie rock, so much the better. He had just enrolled at Cardiff University, and he didn’t know anyone at all. Fortunately, he had just discovered Myspace right before heading out to u… [+77846 chars]"}],"Etsy":[{"source":{"id":null,"name":"Etsy.com"},"author":"Rachel Smith","title":"Standout Statement Earrings to Buy or DIY","description":"Birthday, big date, or just your average Sunday at the supermarket: wherever you’re going, with an eye-catching pair of statement earrings you bring the party. From the bold and colorful to the glimmering and dangly, the wildly creative options available on E…","url":"https://blog.etsy.com/en/standout-statement-earrings-to-buy-or-diy/","urlToImage":"https://blog.etsy.com/en/files/2028/12/diy_confetti_earrings-small.jpeg","publishedAt":"2020-03-05T15:52:21Z","content":"Birthday, big date, or just your average Sunday at the supermarket: wherever you’re going, with an eye-catching pair of statement earrings you bring the party. From the bold and colorful to the glimmering and dangly, the wildly creative options available on E… [+3077 chars]"},{"source":{"id":null,"name":"Etsy.com"},"author":"Heather Baird","title":"A Colorful DIY Dessert to Make Easter a Little Sweeter","description":"Photo by Heather Baird Whether you’re adding some extra love to your Easter baskets or just looking for a colorful DIY to try at home with your kiddos, this candy-loaded chocolate bark is sure to brighten everyone’s day. The best part? The recipe is deceptive…","url":"https://blog.etsy.com/en/make-colorful-candy-loaded-chocolate-bark-this-easter/","urlToImage":"https://blog.etsy.com/en/files/2017/02/bunny-bark-thumbnail-.jpg","publishedAt":"2020-03-27T14:12:58Z","content":"Photo by Heather Baird Whether you’re adding some extra love to your Easter baskets or just looking for a colorful DIY to try at home with your kiddos, this candy-loaded chocolate bark is sure to brighten everyone’s day. The best part? The recipe is deceptive… [+2829 chars]"},{"source":{"id":null,"name":"Etsy.com"},"author":"Heather Baird","title":"How to Make an Edible Terrarium","description":"Photo by Heather Baird Editor’s note, April 2020: We’ll confess we’ve been so busy working on our embroidery kits and reorganizing our pajama drawers that we’ve worked up something of an appetite—which sent us in search of some of our favorite food crafts fro…","url":"https://blog.etsy.com/en/make-an-edible-terrarium/","urlToImage":"https://blog.etsy.com/en/files/2016/03/Chocolate-Terrarium-header-new-small.jpg","publishedAt":"2020-04-02T21:06:06Z","content":"Photo by Heather Baird Editor’s note, April 2020: We’ll confess we’ve been so busy working on our embroidery kits and reorganizing our pajama drawers that we’ve worked up something of an appetite—which sent us in search of some of our favorite food crafts fro… [+4877 chars]"}],"The Times of India":[{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Shaili Chopra","title":"Blog: Are you doing this to your child?","description":"After days of breakfasting at home we went out today to a cafe to eat. The man on the next table coughed. Or so I thought. Because my head is so wired to hear sneezes...","url":"https://timesofindia.indiatimes.com/blogs/underscore/coronavirus-parenting-are-you-doing-this-to-your-child-and-yourself/","urlToImage":"https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2016/12/SHAILI-CHOPRA-HI-RES-PHOTO.jpg","publishedAt":"2020-03-15T07:38:43Z","content":"After days of breakfasting at home we went out today to a cafe to eat. The man on the next table coughed. Or so I thought. Because my head is so wired to hear sneezes and coughs, like Snape from Harry Potter, that I mistook his very phlegmy laughter for a cou… [+6030 chars]"}],"Refinery29":[{"source":{"id":null,"name":"Refinery29.com"},"author":"Olivia Harrison, written by Olivia Harrison","title":"The Pantry Meals Real People Are Cooking Right Now","description":"As coronavirus continues to spread, many are making the smart decision to practice social distancing and stay at home. That means we’re skipping the weekend brunches and after-work happy hours with friends — many bars and restaurants are cancelling or limitin…","url":"https://www.refinery29.com/en-ca/2020/03/9571365/pantry-recipes-for-coronavirus","urlToImage":"https://www.refinery29.com/images/9564418.jpg?crop=2000%2C1051%2Cx0%2Cy1249","publishedAt":"2020-03-17T20:45:34Z","content":"Name: SueAge: 28Pantry staples this meal calls for: Cannellini beans, boxed pasta, and red pepper flakes OR canned tomatoes and breadcrumbs OR red wine vinegar, coconut sugar, and salt.\r\nDo you use a specific recipe for this dish?Bon Appetit has a ton of reci… [+1287 chars]"}],"Adafruit":[{"source":{"id":null,"name":"Adafruit.com"},"author":"Jamie Halliday","title":"Stay Home: The Best of Adafruit’s “TasteMakers” Q&A Series","description":"In Stay Home, we’re re-highlighting some original editorial Adafruit blog content that might help to keep you entertained and inspired while working remotely or otherwise staying home. Last week we shared some highlights from our MusicMakers Q&A with some of …","url":"https://blog.adafruit.com/2020/03/30/stay-home-the-best-of-adafruits-tastemakers-qa-series/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2020/03/adafruit_soundcloud_header_2-1.jpg","publishedAt":"2020-03-30T15:20:01Z","content":"In Stay Home, we’re re-highlighting some original editorial Adafruit blog content that might help to keep you entertained and inspired while working remotely or otherwise staying home. Last week we shared some highlights from our MusicMakers Q&amp;A with some… [+5509 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Natalie Zee Drieu","title":"STEM + Homeschooling for your Kids #STEM #HomeSchooling","description":"As many of us are experiencing shelter at home with the coronavirus pandemic, those of us with kids are experiencing homeschooling for the first time. My 11 year old daughter has virtual classes with her 6th grade class but in a limited schedule. If you are a…","url":"https://blog.adafruit.com/2020/03/27/stem-homeschooling-for-your-kids/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2020/03/stemkids-main-exploratorium-1.jpg","publishedAt":"2020-03-27T13:30:14Z","content":"As many of us are experiencing shelter at home with the coronavirus pandemic, those of us with kids are experiencing homeschooling for the first time. My 11 year old daughter has virtual classes with her 6th grade class but in a limited schedule. If you are a… [+7402 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Jessie Mae","title":"Adafruit Weekly Editorial Round-Up: Adafruit deemed an essential service, Open Source Protective Face Shield Designs, Raspberry pi activities you can do at home, Adafruit Pets and more!","description":"ADAFRUIT WEEKLY EDITORIAL ROUND-UPWe’ve got so much happening here at Adafruit that it’s not always easy to keep up! Don’t fret, we’ve got you covered. Each week we’ll be posting a handy round-up of what we’ve been up to, ranging from learn guides to blog art…","url":"https://blog.adafruit.com/2020/03/29/adafruit-weekly-editorial-round-up-adafruit-deemed-an-essential-service-open-source-protective-face-shield-designs-raspberry-pi-activities-you-can-do-at-home-adafruit-pets-and-more/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2020/03/I28319464413_3d28f1ec36_k.jpg","publishedAt":"2020-03-29T19:00:23Z","content":"March 29, 2020 AT 3:00 pm\r\nAdafruit Weekly Editorial Round-Up: Adafruit deemed an essential service, Open Source Protective Face Shield Designs, Raspberry pi activities you can do at home, Adafruit Pets and more!\r\nADAFRUIT WEEKLY EDITORIAL ROUND-UP\r\nWe’ve got… [+4588 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Anne Barela","title":"Maker Update #163: While my BLE Gently Weeps #MakerUpdate #Adafruit @Adafruit @photoresistor","description":"While my BLE Gently Weeps [Maker Update #163]This week on the Adafruit edition of Maker Update (video): a chonker synth, glowing glass, spinning cycles, assistive tech, cyberpunk, and how to build a testing jig.Show Notes [Maker Update #163]Project of the Mon…","url":"https://blog.adafruit.com/2020/03/02/maker-update-163-while-my-ble-gently-weeps-makerupdate-adafruit-adafruit-photoresistor/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2020/03/untitled-2.jpg","publishedAt":"2020-03-02T16:40:39Z","content":"March 2, 2020 AT 11:40 am\r\nMaker Update #163: While my BLE Gently Weeps #MakerUpdate #Adafruit @Adafruit @photoresistor\r\nThis week on the Adafruit edition of Maker Update (video): a chonker synth, glowing glass, spinning cycles, assistive tech, cyberpunk, and… [+3874 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Anne Barela","title":"ICYMI CircuitPython Newsletter: CircuitPython empowering makers to make businesses and more! #Python #Adafruit #CircuitPython #ICYMI @circuitpython @micropython @ThePSF @Adafruit","description":"ICYMI (In case you missed it) – Yesterday’s Python on Microcontrollers Newsletter from AdafruitDaily.com went out.If you missed it, subscribe now! – You’ll get one fab newsletter each Tuesday (before this post the next day). Over 7,555 subscribers worldwide!T…","url":"https://blog.adafruit.com/2020/03/11/icymi-circuitpython-newsletter-circuitpython-empowering-makers-to-make-businesses-and-more-python-adafruit-circuitpython-icymi-circuitpython-micropython-thepsf-adafruit/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2019/10/ICYMI-Newsletter6.png","publishedAt":"2020-03-11T13:30:21Z","content":"ICYMI (In case you missed it) – Yesterday’s Python on Microcontrollers Newsletter from AdafruitDaily.com went out.\r\nIf you missed it, subscribe now! – You’ll get one fab newsletter each Tuesday (before this post the next day). Over 7,555 subscribers worldwide… [+26489 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Anne Barela","title":"ICYMI CircuitPython Newsletter: CircuitPython 5, Open-source Python bike computers, and more! #Python #Adafruit #CircuitPython #ICYMI @circuitpython @micropython @ThePSF @Adafruit","description":"ICYMI (In case you missed it) – Yesterday’s Python on Microcontrollers Newsletter from AdafruitDaily.com went out.If you missed it, subscribe now! – You’ll get one fab newsletter each Tuesday (before this post the next day). Over 7,500 subscribers worldwide!T…","url":"https://blog.adafruit.com/2020/03/04/icymi-circuitpython-newsletter-circuitpython-5-open-source-python-bike-computers-and-more-python-adafruit-circuitpython-icymi-circuitpython-micropython-thepsf-adafruit/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2019/10/ICYMI-Newsletter6.png","publishedAt":"2020-03-04T14:35:58Z","content":"ICYMI (In case you missed it) – Yesterday’s Python on Microcontrollers Newsletter from AdafruitDaily.com went out.\r\nIf you missed it, subscribe now! – You’ll get one fab newsletter each Tuesday (before this post the next day). Over 7,500 subscribers worldwide… [+33021 chars]"}],"Noupe":[{"source":{"id":null,"name":"Noupe.com"},"author":"Andi Croft","title":"Beginner’s Guide: 9 Steps to Build Your First Website From Scratch","description":"Are you looking forward to building a website from scratch, and yet you don’t exactly know how? Well, you’ve come to the right place! It doesn’t matter if you wanted to start a blog or create a website for your business. Setting up a site is much easier than …","url":"https://www.noupe.com/design/build-your-first-website-from-scratch.html","urlToImage":"https://www.noupe.com/wp-content/uploads/2020/03/123-1.jpg","publishedAt":"2020-03-13T07:29:26Z","content":"Are you looking forward to building a website from scratch, and yet you don’t exactly know how? Well, you’ve come to the right place!\r\nIt doesn’t matter if you wanted to start a blog or create a website for your business. Setting up a site is much easier than… [+5395 chars]"}],"Mint":[{"source":{"id":null,"name":"Mint.com"},"author":"Elle Martinez","title":"How 4 Moms are Gaining Financial Security Through Side Hustles","description":"If you're thinking about a side-hustle but are unsure how to start, here are four moms who have transformed their family's finances. Full Story The post How 4 Moms are Gaining Financial Security Through Side Hustles appeared first on MintLife Blog.","url":"https://blog.mint.com/family/how-4-moms-are-gaining-financial-security-through-side-hustles/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/03/women-with-side-hustles.jpg?resize=1200,630","publishedAt":"2020-03-06T01:41:31Z","content":"While the traditional 9-5 office model is slow to adapt to the needs of modern parents, some moms and dads are taking matters into their own hands. They are looking at ways to earn extra income while having flexibility in their schedules, including finding a … [+5120 chars]"},{"source":{"id":null,"name":"Mint.com"},"author":"Mint.com","title":"11 Money-Saving Tips for New or Expecting Parents (+ Printables)","description":"Having a baby is one of the most exciting times as a family. From your daily routine to your bank account, babies change just about everything. And as a parent, you want the best for your growing baby. You want... Full Story The post 11 Money-Saving Tips for …","url":"https://blog.mint.com/family/money-saving-tips-for-new-or-expecting-parents/","urlToImage":"https://blog.mint.com/wp-content/uploads/2020/03/New-Parent-Printables-Hero-Image.jpeg?resize=1200,630","publishedAt":"2020-03-13T14:36:27Z","content":"Having a baby is one of the most exciting times as a family. From your daily routine to your bank account, babies change just about everything. And as a parent, you want the best for your growing baby. You want them to have the future of their dreams and help… [+9154 chars]"}],"Poppytalk":[{"source":{"id":null,"name":"Poppytalk.com"},"author":"Jan Halvarson","title":"A Converted Stable Becomes a Seasonal Home in Northern Spain","description":"A blog about DIY, design, arts and crafts.","url":"http://www.poppytalk.com/2020/03/a-converted-stable-becomes-seasonal.html","urlToImage":"https://1.bp.blogspot.com/-_yXyP8f-Zas/XoJSuGKPBxI/AAAAAAABti0/pFSduCZiXkYig4XozoHXp2HIhZl3BabuwCLcBGAsYHQ/w1200-h630-p-k-no-nu/standard_190729_Zooco_Guemes_064.jpg","publishedAt":"2020-03-31T05:19:00Z","content":"Located in a small town east of Santander, Spain, a former stable was recently converted into a seasonal home by architects, Zooco Estudio. Consisting of stone walls and a wooden-structure gable roof with tiles, the nature of this architectural intervention w… [+2019 chars]"},{"source":{"id":null,"name":"Poppytalk.com"},"author":"Jan Halvarson","title":"12 Quarantine Redecorating Ideas We Found From the Stylists at IKEA","description":"A blog about DIY, design, arts and crafts.","url":"http://www.poppytalk.com/2020/03/12-quarantine-redecorating-ideas-we.html","urlToImage":"https://1.bp.blogspot.com/-ti054txoKF4/Xm0-WgeeNoI/AAAAAAABtg4/pJVbV44zPlUZqi6CxPN1x8zVHhW7BKjOACLcBGAsYHQ/w1200-h630-p-k-no-nu/Screen%2BShot%2B2020-03-13%2Bat%2B1.43.48%2BPM.png","publishedAt":"2020-03-23T17:32:00Z","content":"MISTERHULT lighting Amid these strange times I'm still been getting updates in my inbox on new things from the design world, and as strange as it seems to be writing about design with all that is happening around us, I thought maybe we'd all enjoy a little es… [+4965 chars]"},{"source":{"id":null,"name":"Poppytalk.com"},"author":"Jan Halvarson","title":"IDEA School of Design Grad Show Takes It Online","description":"A blog about DIY, design, arts and crafts.","url":"http://www.poppytalk.com/2020/03/idea-school-of-design-grad-show-takes.html","urlToImage":"https://1.bp.blogspot.com/-Sb0GzNdPffs/XoLbCoW9fHI/AAAAAAABtkw/gLWx4ntIKz46SksHh5hRh5nIg2SbJj2pwCLcBGAsYHQ/w1200-h630-p-k-no-nu/Screen%2BShot%2B2020-03-30%2Bat%2B10.53.56%2BPM.png","publishedAt":"2020-03-31T06:20:00Z","content":"With the current evens being what they are, this year's IDEA Grad show at Capilano University has become a virtual browsing experience. This year's grad show theme is Get \"Em While They're Fresh, suggesting a marketplace for industry professionals to inspect … [+1038 chars]"},{"source":{"id":null,"name":"Poppytalk.com"},"author":"Jan Halvarson","title":"The Lilypad | A Cozy Container Vacation Home","description":"A blog about DIY, design, arts and crafts.","url":"http://www.poppytalk.com/2020/03/the-lilypad-cozy-container-vacation-home.html","urlToImage":"https://1.bp.blogspot.com/-_rEoVpYVeXc/XmKOFoe_gzI/AAAAAAABtfQ/FBF9VjsdtXcmev-NJ5X-xKrZvLRUpQF7gCLcBGAsYHQ/w1200-h630-p-k-no-nu/1.jpg","publishedAt":"2020-03-08T00:48:00Z","content":"Nestled on 13 acres of woods this adorable shipping container Airbnb is inspiring. Dubbed, The Lilypad, we're loving it's black facade and cozy interior and thought it would be a perfect addition to our hotel style series here on Poppytalk. Let's take a look!… [+1010 chars]"}],"Github.blog":[{"source":{"id":null,"name":"Github.blog"},"author":"Martin","title":"Open collaboration on COVID-19","description":"Explore some impactful open source projects being created by teams around the world in response to COVID-19. The post Open collaboration on COVID-19 appeared first on The GitHub Blog.","url":"https://github.blog/2020-03-23-open-collaboration-on-covid-19/","urlToImage":"https://github.blog/wp-content/uploads/2019/03/BlogHeaders_Aligned_COMMUNITY_1008x602_x2.png?resize=1024,612","publishedAt":"2020-03-23T20:16:59Z","content":"In the midst of the uncertainty and seriousness of COVID-19, we’ve been inspired to see a global community of scientists, government officials, journalists, programmers, and concerned citizens come together to collaborate on a variety of projects with the sha… [+8148 chars]"}],"Convinceandconvert":[{"source":{"id":null,"name":"Convinceandconvert.com"},"author":"Zontee Hou","title":"5 B2B Content Marketing Examples You Can Copy","description":"B2B marketing can sometimes seem to play second fiddle to its more glamorous sister, B2C marketing. When it comes to content marketing, campaigns built for consumer audiences are often more intuitive, more fun, or more colorful for the audiences and the marke…","url":"https://www.convinceandconvert.com/content-marketing/b2b-content-marketing-examples/","urlToImage":"https://www.convinceandconvert.com/wp-content/uploads/2020/03/5-B2B-Content-Marketing-Examples-You-Can-Copy.png","publishedAt":"2020-03-30T13:43:23Z","content":"B2B marketing can sometimes seem to play second fiddle to its more glamorous sister, B2C marketing. When it comes to content marketing, campaigns built for consumer audiences are often more intuitive, more fun, or more colorful for the audiences and the marke… [+6862 chars]"}],"People":[{"source":{"id":null,"name":"People.com"},"author":"Hannah Chubb","title":"Celebrity Organizers Share ‘14 Day Guide’ to Cleaning Out Your House While Social Distancing","description":"The Home Edit co-founders Clea Shearer and Joanna Teplin have taken a break from transforming celebrity homes in order to practice social distancing amid the spread of the novel coronavirus (COVID-19). But while the professional organizers are staying home in…","url":"https://people.com/home/celebrity-organizers-share-14-day-guide-to-cleaning-out-your-house-while-social-distancing/","urlToImage":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2019%2F03%2Fedit.jpg%3Fcrop%3D0px%2C0px%2C1728px%2C907px%26resize%3D1200%2C630","publishedAt":"2020-03-20T15:44:16Z","content":"The Home Edit co-founders Clea Shearer and Joanna Teplin have taken a break from transforming celebrity homes in order to practice social distancing amid the spread of the novel coronavirus (COVID-19). But while the professional organizers are staying home in… [+3422 chars]"}],"Gadgethacks":[{"source":{"id":null,"name":"Gadgethacks.com"},"author":"Justin Meyers","title":"5 Ventilator Hacks Doctors & DIYers Are Sharing in the Face of Shortages to Try & Help Save COVID-19 Patients","description":"With the nation facing a shortage of ventilators for COVID-19 patients and no apparent ramp-up in the production of new ones, engineers, medical resistents, and do-it-yourselfers are sharing plans for homemade versions. But before you go online to start order…","url":"https://www.gadgethacks.com/news/5-ventilator-hacks-doctors-diyers-are-sharing-face-shortages-try-help-save-covid-19-patients-0277756/","urlToImage":"https://img.gadgethacks.com/img/29/90/63720308973296/0/5-ventilator-hacks-doctors-diyers-are-sharing-face-shortages-try-help-save-covid-19-patients.1280x600.jpg","publishedAt":"2020-03-20T20:50:00Z","content":"With the nation facing a shortage of ventilators for COVID-19 patients and no apparent ramp-up in the production of new ones, engineers, medical resistents, and do-it-yourselfers are sharing plans for homemade versions.\r\nBut before you go online to start orde… [+5142 chars]"}],"Gq":[{"source":{"id":null,"name":"Gq.com"},"author":"The Editors of GQ","title":"The 39 Best Online Clothing Stores for Menswear in 2020","description":"Every spot to buy great menswear, all in one place.","url":"https://www.gq.com/story/best-online-shopping-sites-for-menswear","urlToImage":"https://media.gq.com/photos/5e5fece63982890008625943/16:9/w_1280,c_limit/gq-Best-online-shopping-sites-march-2020-16x9.jpg","publishedAt":"2020-03-09T13:00:00Z","content":"In 2020, you can't talk shopping without talking e-comm, and the best online shopping sites for men (or anyone shopping for menswear) are better than ever, full of rare gear and tried-and-true standards alike. (Free shipping doesn't hurt, either.) But shoppin… [+13842 chars]"}],"R-bloggers":[{"source":{"id":null,"name":"R-bloggers.com"},"author":"Gregory Kanevsky","title":"Survey Results: What Degree is Best for Data Science?","description":"The Survey  The survey What Degree is Best for Data Science? ran from  February 9 through March 12, 2020 asking participants 4 questions:   Answers about self:  Q1: What is the highest level of school degree you have completed?  Q2: Which of the following bes…","url":"https://www.r-bloggers.com/survey-results-what-degree-is-best-for-data-science/","urlToImage":"https://1.bp.blogspot.com/-OHIZ5zYYEGY/XmnIzcqnd_I/AAAAAAABVYg/XCjkLCNPL3o-BamkIV30Ls_1jGWcI78hgCPcBGAYYCw/s400/Screen%2BShot%2B2020-03-12%2Bat%2B00.29.27.png","publishedAt":"2020-03-18T05:28:00Z","content":"[This article was first published on novyden, and kindly contributed to R-bloggers]. (You can report issue about the content on this page here)\r\nWant to share your content on R-bloggers? click here if you have a blog, or here if you don't.\r\nThe Survey \r\nThe s… [+2774 chars]"}],"Scottadamssays":[{"source":{"id":null,"name":"Scottadamssays.com"},"author":"Scott Adams, Scott Adams","title":"Episode 880 Scott Adams: Enjoy the Simultaneous Swaddle and DIY Ventilator Instructions","description":"My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a Content: A DIY ventilator for about $100 President Trump’s best press conference to date Disappearing medical supplies sent to NYC Bill Ackman proposes biggest infrastructure program …","url":"https://www.scottadamssays.com/2020/03/29/episode-880-scott-adams-enjoy-the-simultaneous-swaddle-and-diy-ventilator-instructions/","urlToImage":"http://www.scottadamssays.com/wp-content/uploads/2020/03/Episode-880.png","publishedAt":"2020-03-30T03:45:11Z","content":"My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a\r\nContent:\r\n<ul><li>A DIY ventilator for about $100</li><li>President Trump’s best press conference to date</li><li>Disappearing medical supplies sent to NYC</li><li>Bill Ackman propos… [+438 chars]"}],"Forbes":[{"source":{"id":null,"name":"Forbes.com"},"author":"Janice Gassam, Contributor, Janice Gassam, Contributor https://www.forbes.com/sites/janicegassam/","title":"Why This Lawyer Left Her $300,000 Job To Help Small Businesses Thrive","description":"This article features an interview with a former lawyer who left a lucrative $300,000 career to pursue entrepreneurship.","url":"https://www.forbes.com/sites/janicegassam/2020/03/10/why-this-lawyer-left-her-300000-job-to-help-small-businesses-thrive/","urlToImage":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67bf09aa54280007597d21%2F0x0.jpg","publishedAt":"2020-03-10T16:25:13Z","content":"Ashley Kirkwood, founder of Mobile General Counsel\r\nAshley Kirkwood\r\nEntrepreneurship seems like its all fun, sitting in front of the beach, on your laptop, designing your own schedule with no boss to answer to. While there are many perks to business ownershi… [+7903 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jeff Rose, Contributor, Jeff Rose, Contributor https://www.forbes.com/sites/jrose/","title":"6 Pieces Of Financial Advice You Shouldn’t Follow","description":"There’s a lot of bad financial advice out there disguised as good advice. Your priority should be to educate yourself about personal finance and decide what’s best for you.","url":"https://www.forbes.com/sites/jrose/2020/03/10/6-pieces-of-financial-advice-you-shouldnt-follow/","urlToImage":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1168002637%2F0x0.jpg%3FcropX1%3D1%26cropX2%3D4731%26cropY1%3D91%26cropY2%3D2751","publishedAt":"2020-03-10T12:30:00Z","content":"Theres no shortage of bad financial advice in this world. To find it, all you need to do is ask for money tips from your co-workers or consult your uncle who insists he can time the market.  \r\nGetty\r\nOnce, when I was younger, I really wanted to buy a big scre… [+10288 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"TJ McCue, Contributor, TJ McCue, Contributor https://www.forbes.com/sites/tjmccue/","title":"Calling All Makers With 3D Printers: Join Critical Mission To Make Face Masks And Shields For 2020 Healthcare Workers","description":"After seeing the N95 shortage gripping the nation’s healthcare workers, HP Inc. and partners mobilized to create 3D printed face mask and face shield solutions, plus a few other innovative ideas, to keep people safe during the COVID-19 outbreak.","url":"https://www.forbes.com/sites/tjmccue/2020/03/24/calling-all-makers-with-3d-printers-join-critical-mission-to-make-face-masks-and-shields-for-2020-healthcare-workers/","urlToImage":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e7aa8f410380d0006fc079d%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D639%26cropY1%3D33%26cropY2%3D393","publishedAt":"2020-03-25T00:45:53Z","content":"After seeing the N95 shortage gripping the nations healthcare workers, HP Inc. and partners have mobilized to create 3D printed face mask and face shield solutions, plus a few other innovative ideas, to keep people safe during the COVID-19 outbreak. \r\nHP 3D P… [+8699 chars]"}],"Stylebyemilyhenderson":[{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Jess Bunge","title":"Our All-Time Favorite #Adulting Bedroom Paint Colors That Aren’t White","description":"I think it’s fair to say that most of us reading this blog are adults (or so says our birth certificates even if our minds “partially” disagree:)) So because of this likely fact, I think that wanting your home to feel like it’s an “adult space” especially whe…","url":"http://stylebyemilyhenderson.com/bedroom-paint-colors/","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/03/Emily-Henderson_Bedroom-Paint-Colors_8_opener.jpg","publishedAt":"2020-03-03T09:00:16Z","content":"design by sarah sherman samuel | photo by jason frank rothenberg | via domino\r\nI think it’s fair to say that most of us reading this blog are adults (or so says our birth certificates even if our minds “partially” disagree:)) So because of this likely fact, I… [+7667 chars]"},{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Jess Bunge","title":"Our All-Time Favorite #Adulting Bedroom Paint Colors That Aren’t White","description":"I think it’s fair to say that most of us reading this blog are adults (or so says our birth certificates even if our minds “partially” disagree:)) So because of this likely fact, I think that wanting your home to feel like it’s an “adult space” especially whe…","url":"http://stylebyemilyhenderson.com/blog/bedroom-paint-colors","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/03/Emily-Henderson_Bedroom-Paint-Colors_8_opener.jpg","publishedAt":"2020-03-03T09:00:16Z","content":"design by sarah sherman samuel | photo by jason frank rothenberg | via domino\r\nI think it’s fair to say that most of us reading this blog are adults (or so says our birth certificates even if our minds “partially” disagree:)) So because of this likely fact, I… [+7667 chars]"},{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Emily","title":"Weekend Art Project: Easy Kids DIY Silhouette Portraits","description":"In an attempt to force my kids to relive my childhood I wanted us to all do silhouettes for their room in LA, just as I did as a wee lady. Of course in the ’80s we had to use a school projector and trace the wall, but with modern technology, you can really ju…","url":"http://stylebyemilyhenderson.com/blog/easy-kids-diy-art-silhouette-portraits","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/04/opener_2-copy.jpg","publishedAt":"2020-04-03T08:00:52Z","content":"In an attempt to force my kids to relive my childhood I wanted us to all do silhouettes for their room in LA, just as I did as a wee lady. Of course in the ’80s we had to use a school projector and trace the wall, but with modern technology, you can really ju… [+6593 chars]"},{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Emily","title":"GOOD DIY Art Inspiration + A How-To of Julie’s Original Piece (And A Kickoff of My Weekly DIY Challenge – Wanna Join?)","description":"We feel like there are two kinds of people right now. First, are those who desperately need house projects to fill these days (and give us purpose) and make their house even homier. Then there are those who don’t want to feel guilty about watching the news an…","url":"http://stylebyemilyhenderson.com/blog/the-best-diy-wall-art","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/03/Emily-Henderson_DIY-Art_Opener_Collage_02.jpg","publishedAt":"2020-03-27T08:05:03Z","content":"We feel like there are two kinds of people right now. First, are those who desperately need house projects to fill these days (and give us purpose) and make their house even homier. Then there are those who don’t want to feel guilty about watching the news an… [+11490 chars]"},{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Emily","title":"How’s It All Going? A Letter From Me, From Home… And All The Small House Projects I’m Tackling Right Now","description":"How are you guys doing? On Friday we left LA, drove up to the mountain house in the pouring rain to self-quarantine. We stopped at a store on the way in to grab last provisions and it was fully stocked, with no more people than usual. I asked the clerk if the…","url":"http://stylebyemilyhenderson.com/blog/an-update-plus-projects-to-tackle","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/03/Emily-Henderson_Update_Projects_to_tackle_Opener.jpg","publishedAt":"2020-03-17T08:05:00Z","content":"How are you guys doing? On Friday we left LA, drove up to the mountain house in the pouring rain to self-quarantine. We stopped at a store on the way in to grab last provisions and it was fully stocked, with no more people than usual. I asked the clerk if the… [+5224 chars]"},{"source":{"id":null,"name":"Stylebyemilyhenderson.com"},"author":"Emily","title":"Relationships Under Quarantine: Twenty Years Together vs Two Months Of Dating. HOW IS IT GOING?","description":"Well, here we are trapped together. When we get married or move in together we all love each other a lot. “Best Friends!” We say. But what if you were told that someday you’d be quarantined together, for 10 weeks or more, essentially trapped in your home. And…","url":"http://stylebyemilyhenderson.com/blog/relationships-during-quarantine","urlToImage":"https://v3c4q5g3.stackpathcdn.com/2020/03/Couples-Post_6.jpg","publishedAt":"2020-03-28T08:05:33Z","content":"photo by 6-year-old charlie henderson\r\nWell, here we are trapped together. When we get married or move in together we all love each other a lot. “Best Friends!” We say. But what if you were told that someday you’d be quarantined together, for 10 weeks or more… [+7637 chars]"}],"Sparkfun":[{"source":{"id":null,"name":"Sparkfun.com"},"author":"Lori Crotser","title":"Learning Outside the Box","description":"During this time of social distancing and quarantine, we're all stuck in confined spaces. Let's learn something new while we're at it!","url":"https://www.sparkfun.com/news/3264","urlToImage":"https://cdn.sparkfun.com/","publishedAt":"2020-04-02T16:13:45Z","content":"During this time of social distancing and quarantine, we're all stuck in confined spaces. Let's learn something new while we're at it!\r\nFavoritedFavorite0\r\nI started out at the front desk here at SparkFun. It was a much-needed break from my traditional job, a… [+2361 chars]"}],"Thriftydecorchick":[{"source":{"id":null,"name":"Thriftydecorchick.com"},"author":"Thrifty Decor Chick","title":"My favorite lighting and outlet hacks {that will save you money!}","description":"My favorite specialty outlets and switches that make life a little easier (and save money!)","url":"https://www.thriftydecorchick.com/2020/04/my-favorite-lighting-and-outlet-hacks.html","urlToImage":"https://1.bp.blogspot.com/-DbBcvmBA6OM/XoSygEhBEzI/AAAAAAABBpg/X_la_Zzydkkv069JpfAYRhyspBHEpzp2wCLcBGAsYHQ/w1200-h630-p-k-no-nu/white-lutron-dimmers-tgcl-153ph-wh-64_1000.jpg?imgmax=1600","publishedAt":"2020-04-01T19:07:00Z","content":"I've been working on little projects while staying safe at home, and I'll continue to share those with you here on the blog! I'm sharing a slightly different DIY today and it involves one so many shudder at... electrical projects. Hang in there with me! I pic… [+5136 chars]"}],"Nerdist":[{"source":{"id":null,"name":"Nerdist.com"},"author":"Eric Diaz","title":"Disney Fans Are Bringing the Theme Parks Home During Quarantine","description":"Stuck in our residences at the moment, many of us are experiencing Disney theme park withdrawal. Luckily, Disney fans are proving to be very creative. The post Disney Fans Are Bringing the Theme Parks Home During Quarantine appeared first on Nerdist.","url":"https://nerdist.com/article/disney-parks-homemade-rides/","urlToImage":"https://nerdist.com/wp-content/uploads/2020/03/pirates-of-the-caribbean-gallery05.jpg","publishedAt":"2020-03-23T20:30:56Z","content":"With all of us in self-quarantine due to the Coronavirus, many people are going a little batty with cabin fever. And for those of us who are near Disney Parks, we now can’t go to our usual “happy place” when things get tough. In this case, quite literally, ou… [+3350 chars]"}],"Portent":[{"source":{"id":null,"name":"Portent.com"},"author":"Evan Hall","title":"SEO A/B Testing With Google Tag Manager","description":"One of the exciting frontiers in Search Engine Optimization is A/B testing. Historically, most of the discourse around split-testing traffic has been for conversion rate optimization or testing ad copy, and it often leaves SEOs out of the fun! Perhaps you’ve …","url":"https://www.portent.com/blog/seo/seo-a-b-testing-with-google-tag-manager.htm","urlToImage":"https://www.portent.com/images/2020/03/Portent-Split_Testing-Blog_Graphic-032420-02.jpg","publishedAt":"2020-03-31T14:00:32Z","content":"Skip to content\r\nSkip post category list\r\nOne of the exciting frontiers in Search Engine Optimization is A/B testing. Historically, most of the discourse around split-testing traffic has been for conversion rate optimization or testing ad copy, and it often l… [+17976 chars]"}],"Niemanlab.org":[{"source":{"id":null,"name":"Niemanlab.org"},"author":"Nicholas Quah","title":"Coronavirus has left a lot of podcast pros recording in their closets","description":"Welcome to Hot Pod, a newsletter about podcasts. This is issue 250, dated March 17, 2020. I guess we’re calling it The Coronavirus Issue. More so than anything else in a very long time, the global coronavirus pandemic is a total event against which almost eve…","url":"https://www.niemanlab.org/2020/03/coronavirus-has-left-a-lot-of-podcast-pros-recording-in-their-closets/","urlToImage":"https://www.niemanlab.org/images/ira-glass-coronavirus-2-cc-700x423.jpg","publishedAt":"2020-03-17T14:54:27Z","content":"Welcome to Hot Pod, a newsletter about podcasts. This is issue 250, dated March 17, 2020. I guess we’re calling it The Coronavirus Issue.\r\nMore so than anything else in a very long time, the global coronavirus pandemic is a total event against which almost ev… [+25580 chars]"}],"Bubbyandbean":[{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"My Credit Journey: How I Established and Maintain Good Credit","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/03/my-credit-journey-how-i-established-and.html","urlToImage":null,"publishedAt":"2020-03-11T12:14:00Z","content":"Thank you Lexington Law Firm for sponsoring this post. A high service partner and consumer advocate that will help you fight for the credit you deserve! I share a lot of the things I most appreciate from my everyday life here - like my home, my family, and ev… [+6815 chars]"},{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"Uncertain Times","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/03/uncertain-times.html","urlToImage":null,"publishedAt":"2020-03-18T20:05:00Z","content":"Guys, I don't even know what to say that hasn't already been said all over the internet and among friends. This is all absolutely surreal. Less than a week ago my plans for today were to be on a flight to Iceland with my husband for a week with the band he wo… [+2945 chars]"},{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"Iceland Bound (Give Me Your Tips!)","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/03/iceland-bound-give-me-your-tips.html","urlToImage":null,"publishedAt":"2020-03-02T13:06:00Z","content":"We leave for Iceland in two weeks and I'm both excited and nervous. We haven't traveled abroad without the kids, well, since before we had kids. And my husband is used to being away from them consistently for work, but I've never been away from them for more … [+1739 chars]"},{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"St. Patrick's Day Inspired Quesadillas","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/03/st-patricks-day-inspired-quesadillas.html","urlToImage":null,"publishedAt":"2020-03-09T12:02:00Z","content":"St. Patrick's Day is a week away, and whether you're Irish or not, it's fun to get into the spirit. (Well, it is for me anyway. But I'm a major sucker for holidays in general, so there's that.) I've shared this story before, but speaking of being Irish, I alw… [+1611 chars]"},{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"The 16 Best Items at Trader Joe's (2020 Edition)","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/03/the-16-best-items-at-trader-joes-2020.html","urlToImage":null,"publishedAt":"2020-03-04T12:46:00Z","content":"Every spring since 2017, I've shared my favorite items from Trader Joe's with with you guys. As I've mentioned before, it's my favorite grocery store for many reasons (healthier options, affordability, overall good vibe), but I mostly love all of the speciali… [+3672 chars]"},{"source":{"id":null,"name":"Bubbyandbean.com"},"author":"Melissa at bubbyandbean.com","title":"We're Back + Our Plans During this New Normal","description":"Bubby and Bean is a design and lifestyle blog that focuses on living creatively through art, design, fashion, DIY projects and tutorials, travel, music life, love, and learning.","url":"https://www.bubbyandbean.com/2020/04/were-back-our-plans-during-this-new.html","urlToImage":null,"publishedAt":"2020-04-02T12:14:00Z","content":"You guys, it has been two weeks and one day since my last post here, which is officially the longest I have ever gone without posting in the almost ten year history of the Bubby and Bean blog. With everything happening right now surrounding Covid-19, I just h… [+1923 chars]"}],"Fastcompany":[{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"Don’t buy a DIY coronavirus test that you can take at home","description":"Last week, several companies announced they would launch home testing for COVID-19. When the FDA said the tests weren’t unauthorized, many have been forced to pull their products. Last week, several direct-to-consumer health companies announced they would sta…","url":"https://www.fastcompany.com/90480851/dont-buy-a-diy-coronavirus-test-that-you-can-take-at-home?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-home-coronavirus-tests-pull-back-after-fda-says-they-are-unauthorized.jpg","publishedAt":"2020-03-23T12:29:20Z","content":"Last week, several direct-to-consumer health companies announced they would start selling do-it-yourself, home-based coronavirus tests. But the Food and Drug Administration made it clear that these “fraudulent test kits” were not authorized, forcing home test… [+3566 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"Don’t buy a DIY coronavirus test that you can take at home","description":"Last week, several companies announced they would launch home testing for COVID-19. When the FDA said the tests weren’t unauthorized, many have been forced to pull their products. Last week, several direct-to-consumer health companies announced they would sta…","url":"https://www.fastcompany.com/90480851/dont-buy-a-diy-coronavirus-test-that-you-can-take-at-home?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-home-coronavirus-tests-pull-back-after-fda-says-they-are-unauthorized.jpg","publishedAt":"2020-03-23T12:29:20Z","content":"Last week, several direct-to-consumer health companies announced they would start selling do-it-yourself, home-based coronavirus tests. But the Food and Drug Administration made it clear that these “fraudulent test kits” were not authorized, forcing home test… [+3566 chars]"}],"Thedailybeast":[{"source":{"id":null,"name":"Thedailybeast.com"},"author":"Tarpley Hitt","title":"Coronavirus Threatens to Finish Off the Alt-Weekly Newspapers","description":"Illustration by The Daily Beast/Getty At 3:30 p.m. last Monday, Caroline Jones, managing editor of the alt-weekly Washington City Paper, received the final copy for their cover story: a feature on an environmental film festival coming to D.C. Fifteen minutes …","url":"https://www.thedailybeast.com/coronavirus-threatens-to-finish-off-the-alt-weekly-newspapers","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_844,w_1500,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1584677583/200319-Hitt-Alt-Weekly-Covid-19-tease_p8gsu0","publishedAt":"2020-03-20T14:17:21Z","content":"At 3:30 p.m. last Monday, Caroline Jones, managing editor of the alt-weekly Washington City Paper, received the final copy for their cover story: a feature on an environmental film festival coming to D.C. Fifteen minutes later, the festival was cancelled. Con… [+8306 chars]"}],"Curbly":[{"source":{"id":null,"name":"Curbly.com"},"author":"M.E. Gray","title":"72 Organization Tips for Every Room of the House","description":"Organization: you either love it or hate it. No matter your stance, having a good system of organizing is the key to a clean, calm living space. And who doesn't want that? We've rounded up our favorite organization tips and DIY projects to help turn your home…","url":"http://www.curbly.com/72-organization-tips","urlToImage":"https://images.curbly.com/ffmSX5b1-1EaLHbgZ8Y5tDwLD2KUmKN8XOfdMSbR5LQ/s:1200:630/plain/http%3A%2F%2Fassets.curbly.com%2Fphotos%2F0000%2F0023%2F3039%2F72_Organization_Tips_web.jpg%3F1489765949","publishedAt":"2020-03-19T15:00:00Z","content":"Organization: you either love it or hate it. No matter your stance, having a good system of organizing is the key to a clean, calm living space. And who doesn't want that? We've rounded up our favorite organization tips and DIY projects to help turn your home… [+11922 chars]"}],"Healthyhappylife":[{"source":{"id":null,"name":"Healthyhappylife.com"},"author":"Kathy Patalsky","title":"Pantry-Friendly Meals: 37 Plant-Based Ideas","description":"Since we are all hunkering down and staying in lately, I wanted to help out a bit on the culinary side of things. I scanned my blog in search of some of what I think are very quarantine-friendly recipes. So here are my 37 plant-based vegan pantry-friendly mea…","url":"https://healthyhappylife.com/pantry-friendly-meals-37-plant-based-ideas/","urlToImage":"https://healthyhappylife.com/wp-content/uploads/2020/03/pantry.png","publishedAt":"2020-03-16T00:28:20Z","content":"Since we are all hunkering down and staying in lately, I wanted to help out a bit on the culinary side of things. I scanned my blog in search of some of what I think are very quarantine-friendly recipes. So here are my 37 plant-based vegan pantry-friendly mea… [+12365 chars]"},{"source":{"id":null,"name":"Healthyhappylife.com"},"author":"Kathy Patalsky","title":"Lemon-Parmesan Garlic Snap Pea Pasta","description":"I love posting green-fueled pasta for spring, and this snap pea and kale loaded Lemon-Parmesan Garlicky Snap Pea Pasta really hits the spot! The flavors are light enough for lunch, yet hearty enough for dinner. I topped the dish with some skillet-toasted vega…","url":"https://healthyhappylife.com/lemon-parmesan-garlic-snap-pea-pasta/","urlToImage":"https://healthyhappylife.com/wp-content/uploads/2020/03/spring-pasta-garlic-lemon-parmesan-snap-peas-vegan-IMG_6099-683x1024.jpg","publishedAt":"2020-03-09T01:39:08Z","content":"I love posting green-fueled pasta for spring, and this snap pea and kale loaded Lemon-Parmesan Garlicky Snap Pea Pasta really hits the spot!\r\nThe flavors are light enough for lunch, yet hearty enough for dinner. I topped the dish with some skillet-toasted veg… [+4034 chars]"},{"source":{"id":null,"name":"Healthyhappylife.com"},"author":"Kathy Patalsky","title":"20 Week Baby Bump (Photos)","description":"Made it. Halfway there. Twenty weeks pregnant. Month five. I am really excited to share my (first ever!) pregnancy bump photos with you. 20 Week Baby Bump Photos, here we go… 20 Weeks. Made it. Despite the strangeness of everyday lately — I am so excited that…","url":"https://healthyhappylife.com/20-week-baby-bump-photos/","urlToImage":"https://healthyhappylife.com/wp-content/uploads/2020/04/kathy-patalsky-healthy-happy-life-baby-bump-week-20-pregnancy-IMG_7007-683x1024.jpg","publishedAt":"2020-04-03T04:01:36Z","content":"Made it. Halfway there. Twenty weeks pregnant. Month five. I am really excited to share my (first ever!) pregnancy bump photos with you.\r\n20 Week Baby Bump Photos, here we go…\r\n20 Weeks. Made it.\r\nDespite the strangeness of everyday lately — I am so excited t… [+4343 chars]"}],"Bmwblog":[{"source":{"id":null,"name":"Bmwblog.com"},"author":"Chuck Vossler","title":"Why Our Road Trip Vehicle Is A 13 Year Old BMW","description":"We love our BMW i3 BEV. It is really the ultimate daily driver but realistically it would very hard to drive it on a long … The article Why Our Road Trip Vehicle Is A 13 Year Old BMW appeared first on BMW BLOG","url":"https://www.bmwblog.com/2020/03/17/why-our-road-trip-vehicle-is-a-13-year-old-bmw/","urlToImage":"https://cdn.bmwblog.com/wp-content/uploads/2020/03/2007-BMW-X3-3.0si-E83-10.jpg","publishedAt":"2020-03-17T17:37:48Z","content":"We love our BMW i3 BEV. It is really the ultimate daily driver but realistically it would very hard to drive it on a long road trip.  Enter the car Ive owned the longest – A 2007 BMW X3 3.0si (E83). It is our go-to vehicle for long road trips. We just returne… [+2856 chars]"},{"source":{"id":null,"name":"Bmwblog.com"},"author":"Chuck Vossler","title":"How to fix a loose door handle on the BMW i3","description":"Now that the BMW i3 has been out a while, some things that need attention are popping up. Here’s a simple guide on how to … The article How to fix a loose door handle on the BMW i3 appeared first on BMW BLOG","url":"https://www.bmwblog.com/2020/03/18/how-to-fix-a-loose-door-handle-on-the-bmw-i3/","urlToImage":"https://cdn.bmwblog.com/wp-content/uploads/2020/03/bmw-i3-fix-door-handle-09.jpg","publishedAt":"2020-03-18T06:09:34Z","content":"Now that the BMW i3 has been out a while, some things that need attention are popping up. Heres a simple guide on how to fix a loose handle door on the BMW i3. \r\nOver time, the BMW i3s unique backward opening door handle starts to get loose towards the front … [+1818 chars]"}],"Pbfingers":[{"source":{"id":null,"name":"Pbfingers.com"},"author":"Julie","title":"Easter Gift Ideas for Kids","description":"Hey friends! Today’s blog post is another reader request — from a few of you actually — and it’s one I haven’t done before so I hope it’s helpful! I had a couple of you reach out to me asking me to share a roundup of Easter gift ideas for little ones and, as …","url":"https://www.pbfingers.com/easter-gift-ideas-for-kids/","urlToImage":"https://www.pbfingers.com/wp-content/uploads/2020/03/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Mothers-Day-1.png","publishedAt":"2020-03-31T12:31:51Z","content":"Hey friends! Today’s blog post is another reader request — from a few of you actually — and it’s one I haven’t done before so I hope it’s helpful! I had a couple of you reach out to me asking me to share a roundup of Easter gift ideas for little ones and, as … [+3668 chars]"},{"source":{"id":null,"name":"Pbfingers.com"},"author":"Julie","title":"Amazon Haul #2: 12 Recent Amazon Finds","description":"Hey friends! How was your weekend? Are any of you out there feelin’ the time change this morning? I made the mistake of leaving Chase’s Hatch Light on his usual 7:30 a.m. “okay to wake” time yesterday which really felt like 6:30 a.m. so we were all running ar…","url":"https://www.pbfingers.com/amazon-haul-2-12-recent-amazon-finds/","urlToImage":"https://www.pbfingers.com/wp-content/uploads/2020/03/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Mothers-Day.png","publishedAt":"2020-03-09T11:26:55Z","content":"Hey friends! How was your weekend? Are any of you out there feelin’ the time change this morning? I made the mistake of leaving Chase’s Hatch Light on his usual 7:30 a.m. “okay to wake” time yesterday which really felt like 6:30 a.m. so we were all running ar… [+12146 chars]"}],"Wellnessmama":[{"source":{"id":null,"name":"Wellnessmama.com"},"author":"Katie Wells","title":"327: Optimizing Gut Health to Keep the Immune System Strong During COVID-19 With Tina Anderson","description":"We’re bringing you a bit of a “special edition” episode today by taking some time to really talk about all that is going on in the world with COVID-19. There are practical and evidence-based strategies and supplements that I’m using to focus on gut and immune…","url":"https://wellnessmama.com/podcast/covid-19/","urlToImage":"https://wellnessmama.com/wp-content/uploads/COVID19.jpg","publishedAt":"2020-04-02T11:00:47Z","content":"Child: Welcome to my Mommy’s podcast.\r\nThis podcast is sponsored by Jigsaw Health, my source for magnesium. You probably know, if you’ve read my blog, that magnesium is responsible for over 300 biochemical reactions in the body. It impacts blood pressure, met… [+52790 chars]"}],"Extrapetite":[{"source":{"id":null,"name":"Extrapetite.com"},"author":"EP Team","title":"Free at home activities and ideas","description":"Sharing a few free activities to do at home including fitness, shows, and DIY kids activities","url":"https://www.extrapetite.com/2020/03/free-activities-to-do-at-home-diy-todders-kids.html","urlToImage":"https://www.extrapetite.com/wp-content/uploads/2017/07/best-youtube-workout-videos-extra-petite.jpg","publishedAt":"2020-03-18T14:06:33Z","content":"Hello friends ~ in these very uncertain times I hope this blog can still be a lighthearted space for some of you! For those who can’t stay home due to your job or other circumstances, I am truly hoping for your continued health and safety. For the rest of us … [+5039 chars]"},{"source":{"id":null,"name":"Extrapetite.com"},"author":"EP Team","title":"5 style & home hacks I’ve been loving","description":"Have you ever wondered how to remove odors from your silicone containers? Make a slippery headband stay in place? Or how to give small surfaces in your home an affordable and quick makeover? Check out some of my favorite easy solutions for around the house...","url":"https://www.extrapetite.com/2020/03/hacks-nonslip-headband-remove-odor-from-silicone.html","urlToImage":"https://www.extrapetite.com/wp-content/uploads/2019/05/ebay-blue-chanel-tweed-jacket-1-e1558833330201.jpg","publishedAt":"2020-03-13T00:01:28Z","content":"Continuing from my last post on style hacks, I wanted to share a couple more quick fixes Ive been loving for a mix of everyday problems! These solutions take just a few minutes to do (or to order on Amazon) – Ive shared a few before on IG stories and wanted t… [+4336 chars]"}],"Vanityfair":[{"source":{"id":null,"name":"Vanityfair.com"},"author":"Lisa Abend","title":"How Kinfolk Magazine Defined the Millennial Aesthetic…and Unraveled Behind the Scenes","description":"The cult quarterly helped set the pace for the upwardly mobile, Instagram-perfect 2010s lifestyle. Off the page, its creators’ lives have been somewhat messier.","url":"https://www.vanityfair.com/style/2020/03/how-kinfolk-magazine-defined-the-millennial-aesthetic-and-unraveled-behind-the-scenes","urlToImage":"https://media.vanityfair.com/photos/5e727a8652ad2c00089f4f65/16:9/w_1280,c_limit/VF0420_Kinfolk_Lede.jpg","publishedAt":"2020-03-19T11:00:00Z","content":"Kinfolks origin story seems just as perfect, a charming myth crafted along the lines of one of those old Rooney-Garland, Hey gang, lets put on a show musicals. At the turn of the last decade, while still in college, two young married couples have the kooky id… [+4153 chars]"}],"Thecut":[{"source":{"id":null,"name":"Thecut.com"},"author":"Anna Silman","title":"Lee’s American Dream","description":"We said we followed the influencer for her wellness tips. But were our motivations really that pure?","url":"https://www.thecut.com/2020/03/wellness-influencer-lee-from-americas-story.html","urlToImage":"https://pixel.nymag.com/imgs/fashion/daily/2020/03/03/Lee_02.w1200.h630.jpg","publishedAt":"2020-03-10T11:00:05Z","content":"Lee Tilghman says her Instagram followers came to Lee From America for the drippy food content. They came for the buttery egg yolks, the clumps of gooey peanut butter, the tahini drizzled over veggies like a Jackson Pollock splatter painting. They came for ad… [+16738 chars]"}],"Medium":[{"source":{"id":null,"name":"Medium.com"},"author":"Steve Rousseau","title":"I Lived Off Homemade Soylent For A Week During A Global Crisis","description":"In early 2013, software engineer Rob Rhinehart wrote a blog post about how he had stopped eating food. Instead, he was consuming a meal replacement powder of his own design. He called it soylent…","url":"https://onezero.medium.com/i-lived-off-homemade-soylent-for-a-week-during-a-global-crisis-8aa32742eec4","urlToImage":"https://miro.medium.com/focal/1200/632/50/41/1*VJoefL_a-qZbQ49ENaJC3A.png","publishedAt":"2020-04-03T13:40:54Z","content":"In early 2013, software engineer Rob Rhinehart wrote a blog post about how he had stopped eating food. Instead, he was consuming a meal replacement powder of his own design. He called it soylent.\r\nWithin a few months, Rhinehart launched a very successful crow… [+10010 chars]"}]}